



<!doctype html>
<html lang="zh" class="no-js">
  <head>
    
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width,initial-scale=1">
      <meta http-equiv="x-ua-compatible" content="ie=edge">
      
        <meta name="description" content="Documentation for Nebula Graph">
      
      
        <link rel="canonical" href="http://docs.nebula-graph.io/cn-manual-doc/cn_Statement_Syntax/DATA_Manipulation_Statements/Go_Syntax/">
      
      
        <meta name="author" content="Nebula Graph">
      
      
        <meta name="lang:clipboard.copy" content="复制">
      
        <meta name="lang:clipboard.copied" content="已复制">
      
        <meta name="lang:search.language" content="ja">
      
        <meta name="lang:search.pipeline.stopwords" content="True">
      
        <meta name="lang:search.pipeline.trimmer" content="True">
      
        <meta name="lang:search.result.none" content="没有找到符合条件的结果">
      
        <meta name="lang:search.result.one" content="找到 1 个符合条件的结果">
      
        <meta name="lang:search.result.other" content="# 个符合条件的结果">
      
        <meta name="lang:search.tokenizer" content="[\uff0c\u3002]+">
      
      <link rel="shortcut icon" href="../../../../images/favicon.ico">
      <meta name="generator" content="mkdocs-1.0.4, mkdocs-material-4.2.0">
    
    
      
        <title>Go syntax - Nebula Graph Docs</title>
      
    
    
      <link rel="stylesheet" href="../../../../assets/stylesheets/application.750b69bd.css">
      
        <link rel="stylesheet" href="../../../../assets/stylesheets/application-palette.224b79ff.css">
      
      
        
        
        <meta name="theme-color" content="#3f51b5">
      
    
    
      <script src="../../../../assets/javascripts/modernizr.74668098.js"></script>
    
    
      
        <link href="https://fonts.gstatic.com" rel="preconnect" crossorigin>
        <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto:300,400,400i,700|Roboto+Mono">
        <style>body,input{font-family:"Roboto","Helvetica Neue",Helvetica,Arial,sans-serif}code,kbd,pre{font-family:"Roboto Mono","Courier New",Courier,monospace}</style>
      
    
    <link rel="stylesheet" href="../../../../assets/fonts/material-icons.css">
    
    
    
      
    
    
  </head>
  
    
    
    <body dir="ltr" data-md-color-primary="indigo" data-md-color-accent="indigo">
  
    <svg class="md-svg">
      <defs>
        
        
          <svg xmlns="http://www.w3.org/2000/svg" width="416" height="448"
    viewBox="0 0 416 448" id="__github">
  <path fill="currentColor" d="M160 304q0 10-3.125 20.5t-10.75 19-18.125
        8.5-18.125-8.5-10.75-19-3.125-20.5 3.125-20.5 10.75-19 18.125-8.5
        18.125 8.5 10.75 19 3.125 20.5zM320 304q0 10-3.125 20.5t-10.75
        19-18.125 8.5-18.125-8.5-10.75-19-3.125-20.5 3.125-20.5 10.75-19
        18.125-8.5 18.125 8.5 10.75 19 3.125 20.5zM360
        304q0-30-17.25-51t-46.75-21q-10.25 0-48.75 5.25-17.75 2.75-39.25
        2.75t-39.25-2.75q-38-5.25-48.75-5.25-29.5 0-46.75 21t-17.25 51q0 22 8
        38.375t20.25 25.75 30.5 15 35 7.375 37.25 1.75h42q20.5 0
        37.25-1.75t35-7.375 30.5-15 20.25-25.75 8-38.375zM416 260q0 51.75-15.25
        82.75-9.5 19.25-26.375 33.25t-35.25 21.5-42.5 11.875-42.875 5.5-41.75
        1.125q-19.5 0-35.5-0.75t-36.875-3.125-38.125-7.5-34.25-12.875-30.25-20.25-21.5-28.75q-15.5-30.75-15.5-82.75
        0-59.25 34-99-6.75-20.5-6.75-42.5 0-29 12.75-54.5 27 0 47.5 9.875t47.25
        30.875q36.75-8.75 77.25-8.75 37 0 70 8 26.25-20.5
        46.75-30.25t47.25-9.75q12.75 25.5 12.75 54.5 0 21.75-6.75 42 34 40 34
        99.5z" />
</svg>
        
      </defs>
    </svg>
    <input class="md-toggle" data-md-toggle="drawer" type="checkbox" id="__drawer" autocomplete="off">
    <input class="md-toggle" data-md-toggle="search" type="checkbox" id="__search" autocomplete="off">
    <label class="md-overlay" data-md-component="overlay" for="__drawer"></label>
    
      <a href="#_1" tabindex="1" class="md-skip">
        跳转至
      </a>
    
    
      <header class="md-header" data-md-component="header">
  <nav class="md-header-nav md-grid">
    <div class="md-flex">
      <div class="md-flex__cell md-flex__cell--shrink">
        <a href="http://docs.nebula-graph.io/" title="Nebula Graph Docs" class="md-header-nav__button md-logo">
          
            <i class="md-icon">library_books</i>
          
        </a>
      </div>
      <div class="md-flex__cell md-flex__cell--shrink">
        <label class="md-icon md-icon--menu md-header-nav__button" for="__drawer"></label>
      </div>
      <div class="md-flex__cell md-flex__cell--stretch">
        <div class="md-flex__ellipsis md-header-nav__title" data-md-component="title">
          
            <span class="md-header-nav__topic">
              Nebula Graph Docs
            </span>
            <span class="md-header-nav__topic">
              Go syntax
            </span>
          
        </div>
      </div>
      <div class="md-flex__cell md-flex__cell--shrink">
        
          <label class="md-icon md-icon--search md-header-nav__button" for="__search"></label>
          
<div class="md-search" data-md-component="search" role="dialog">
  <label class="md-search__overlay" for="__search"></label>
  <div class="md-search__inner" role="search">
    <form class="md-search__form" name="search">
      <input type="text" class="md-search__input" name="query" placeholder="搜索" autocapitalize="off" autocorrect="off" autocomplete="off" spellcheck="false" data-md-component="query" data-md-state="active">
      <label class="md-icon md-search__icon" for="__search"></label>
      <button type="reset" class="md-icon md-search__icon" data-md-component="reset" tabindex="-1">
        &#xE5CD;
      </button>
    </form>
    <div class="md-search__output">
      <div class="md-search__scrollwrap" data-md-scrollfix>
        <div class="md-search-result" data-md-component="result">
          <div class="md-search-result__meta">
            键入以开始搜索
          </div>
          <ol class="md-search-result__list"></ol>
        </div>
      </div>
    </div>
  </div>
</div>
        
      </div>
      
        <div class="md-flex__cell md-flex__cell--shrink">
          <div class="md-header-nav__source">
            


  

<a href="https://github.com/vesoft-inc/nebula/" title="前往 Github 仓库" class="md-source" data-md-source="github">
  
    <div class="md-source__icon">
      <svg viewBox="0 0 24 24" width="24" height="24">
        <use xlink:href="#__github" width="24" height="24"></use>
      </svg>
    </div>
  
  <div class="md-source__repository">
    vesoft-inc/nebula
  </div>
</a>
          </div>
        </div>
      
    </div>
  </nav>
</header>
    
    <div class="md-container">
      
        
      
      
        

  

<nav class="md-tabs md-tabs--active" data-md-component="tabs">
  <div class="md-tabs__inner md-grid">
    <ul class="md-tabs__list">
      
        
  
  
    <li class="md-tabs__item">
      
        <a href="../../../../cn-doc/cn-README/" title="Home" class="md-tabs__link">
          Home
        </a>
      
    </li>
  

      
        
  
  
    
    
  
  
    <li class="md-tabs__item">
      
        <a href="../../../Language_Structure/Comment_Syntax/" title="Manual" class="md-tabs__link">
          Manual
        </a>
      
    </li>
  

  

      
    </ul>
  </div>
</nav>
      
      <main class="md-main">
        <div class="md-main__inner md-grid" data-md-component="container">
          
            
              <div class="md-sidebar md-sidebar--primary" data-md-component="navigation">
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    <nav class="md-nav md-nav--primary" data-md-level="0">
  <label class="md-nav__title md-nav__title--site" for="__drawer">
    <a href="http://docs.nebula-graph.io/" title="Nebula Graph Docs" class="md-nav__button md-logo">
      
        <i class="md-icon">library_books</i>
      
    </a>
    Nebula Graph Docs
  </label>
  
    <div class="md-nav__source">
      


  

<a href="https://github.com/vesoft-inc/nebula/" title="前往 Github 仓库" class="md-source" data-md-source="github">
  
    <div class="md-source__icon">
      <svg viewBox="0 0 24 24" width="24" height="24">
        <use xlink:href="#__github" width="24" height="24"></use>
      </svg>
    </div>
  
  <div class="md-source__repository">
    vesoft-inc/nebula
  </div>
</a>
    </div>
  
  <ul class="md-nav__list" data-md-scrollfix>
    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-1" type="checkbox" id="nav-1">
    
    <label class="md-nav__link" for="nav-1">
      Home
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-1">
        Home
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../../cn-doc/cn-README/" title="Overview" class="md-nav__link">
      Overview
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../../cn-doc/cn-get-started/" title="Getting Started" class="md-nav__link">
      Getting Started
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../../cn-doc/cn-how-to-contribute/" title="Contribute to Nebula" class="md-nav__link">
      Contribute to Nebula
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../../cn-doc/cn-contribute-to-documentation/" title="Contribute to Docs" class="md-nav__link">
      Contribute to Docs
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      

  


  <li class="md-nav__item md-nav__item--active md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2" type="checkbox" id="nav-2" checked>
    
    <label class="md-nav__link" for="nav-2">
      Manual
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-2">
        Manual
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-1" type="checkbox" id="nav-2-1">
    
    <label class="md-nav__link" for="nav-2-1">
      Language structure
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-2-1">
        Language structure
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../Language_Structure/Comment_Syntax/" title="Comment syntax" class="md-nav__link">
      Comment syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../Language_Structure/Identifier_Case_Sensitivity/" title="Identifier" class="md-nav__link">
      Identifier
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../Language_Structure/Property_Reference/" title="Property reference" class="md-nav__link">
      Property reference
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../Language_Structure/Schema_Object_Names/" title="Schema object names" class="md-nav__link">
      Schema object names
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../Language_Structure/Statement_Composition/" title="Statement composition" class="md-nav__link">
      Statement composition
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          

  


  <li class="md-nav__item md-nav__item--active md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-2" type="checkbox" id="nav-2-2" checked>
    
    <label class="md-nav__link" for="nav-2-2">
      Statement syntax
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-2-2">
        Statement syntax
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-2-1" type="checkbox" id="nav-2-2-1">
    
    <label class="md-nav__link" for="nav-2-2-1">
      Data administration statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-2-2-1">
        Data administration statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-2-1-1" type="checkbox" id="nav-2-2-1-1">
    
    <label class="md-nav__link" for="nav-2-2-1-1">
      Account management statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="4">
      <label class="md-nav__title" for="nav-2-2-1-1">
        Account management statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn_Data_Administration_Statements/cn_Account_Management_Statements/Drop_User_Syntax/" title="Drop user syntax" class="md-nav__link">
      Drop user syntax
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-2-1-2" type="checkbox" id="nav-2-2-1-2">
    
    <label class="md-nav__link" for="nav-2-2-1-2">
      Configuration statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="4">
      <label class="md-nav__title" for="nav-2-2-1-2">
        Configuration statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn_Data_Administration_Statements/cn_Configuration_Statements/cn_Variables_Syntax/" title="Variables syntax" class="md-nav__link">
      Variables syntax
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-2-2" type="checkbox" id="nav-2-2-2">
    
    <label class="md-nav__link" for="nav-2-2-2">
      Data definition statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-2-2-2">
        Data definition statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn_Data_Definition_Statements/cn_Alter_Tag_Edge_Syntax/" title="Alter tag edge syntax" class="md-nav__link">
      Alter tag edge syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn_Data_Definition_Statements/Create_Space_Syntax/" title="Create space syntax" class="md-nav__link">
      Create space syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn_Data_Definition_Statements/Create_Tag_Edge_Syntax/" title="Create tag edge syntax" class="md-nav__link">
      Create tag edge syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn_Data_Definition_Statements/Drop_Edge_Syntax/" title="Drop edge syntax" class="md-nav__link">
      Drop edge syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn_Data_Definition_Statements/Drop_Space_Syntax/" title="Drop space syntax" class="md-nav__link">
      Drop space syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn_Data_Definition_Statements/Drop_Tag_Syntax/" title="Drop tage syntax" class="md-nav__link">
      Drop tage syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn_Data_Definition_Statements/Show_Syntax/" title="Show syntax" class="md-nav__link">
      Show syntax
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          

  


  <li class="md-nav__item md-nav__item--active md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-2-3" type="checkbox" id="nav-2-2-3" checked>
    
    <label class="md-nav__link" for="nav-2-2-3">
      Data manipulation statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-2-2-3">
        Data manipulation statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../fetch_Syntax/" title="Fetch syntax" class="md-nav__link">
      Fetch syntax
    </a>
  </li>

        
          
          
          

  


  <li class="md-nav__item md-nav__item--active">
    
    <input class="md-toggle md-nav__toggle" data-md-toggle="toc" type="checkbox" id="__toc">
    
    
      <label class="md-nav__link md-nav__link--active" for="__toc">
        Go syntax
      </label>
    
    <a href="./" title="Go syntax" class="md-nav__link md-nav__link--active">
      Go syntax
    </a>
    
      
<nav class="md-nav md-nav--secondary">
  
  
  
    <label class="md-nav__title" for="__toc">目录</label>
    <ul class="md-nav__list" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#_1" title="示例" class="md-nav__link">
    示例
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#_2" title="参考" class="md-nav__link">
    参考
  </a>
  
</li>
      
      
      
      
      
    </ul>
  
</nav>
    
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../../docs/cn-manual-doc/cn_Statement_Syntax/DATA_Manipulation_Statements/INSERT_EDGE_Syntax.md" title="Insert edge syntax" class="md-nav__link">
      Insert edge syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../INSERT_VERTEX_Syntax/" title="Insert vertex syntax" class="md-nav__link">
      Insert vertex syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../PIPE_Syntax/" title="Pipe syntax" class="md-nav__link">
      Pipe syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../WHERE_Syntax/" title="Where syntax" class="md-nav__link">
      Where syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../YIELD_Syntax/" title="Yield syntax" class="md-nav__link">
      Yield syntax
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

    
  </ul>
</nav>
                  </div>
                </div>
              </div>
            
            
              <div class="md-sidebar md-sidebar--secondary" data-md-component="toc">
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    
<nav class="md-nav md-nav--secondary">
  
  
  
    <label class="md-nav__title" for="__toc">目录</label>
    <ul class="md-nav__list" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#_1" title="示例" class="md-nav__link">
    示例
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#_2" title="参考" class="md-nav__link">
    参考
  </a>
  
</li>
      
      
      
      
      
    </ul>
  
</nav>
                  </div>
                </div>
              </div>
            
          
          <div class="md-content">
            <article class="md-content__inner md-typeset">
              
                
                  <a href="https://github.com/vesoft-inc/nebula/edit/master/docs/cn-manual-doc/cn_Statement_Syntax/DATA_Manipulation_Statements/Go_Syntax.md" title="编辑此页" class="md-icon md-content__icon">&#xE3C9;</a>
                
                
                  <h1>Go syntax</h1>
                
                <p><code>GO</code>是Nebula中最常用的关键字，表示以指定过滤条件（如<code>WHERE</code>）遍历图数据并获取点和边的属性，
以指定顺序（<code>ORDER BY ASC | DESC</code>）返回指定数目（<code>LIMIT</code>）结果。</p>
<blockquote>
<p><code>GO</code>和<code>FIND</code>的用法与SQL中的<code>SELECT</code>类似，重要区别是<code>GO</code>必须从遍历一系列的节点开始。</p>
<p>请参考<code>FIND</code>的用法，它对应于SQL中的<code>SELECT</code>。</p>
</blockquote>
<div class="codehilite"><pre><span></span>GO FROM &lt;node_list&gt;
OVER &lt;edge_type_list&gt;
WHERE (expression [ AND | OR expression ...])  
YIELD | YIELDS  [DISTINCT] &lt;return_list&gt;

&lt;node_list&gt;
   | vid [, vid ...]
   | $-.id

&lt;edge_type_list&gt;
   edge_type [, edge_type ...]

&lt;return_list&gt;   
    &lt;col_name&gt; [AS &lt;col_alias&gt;] [, &lt;col_name&gt; [AS &lt;col_alias&gt;] ...]
</pre></div>


<ul>
<li><node_list>为逗号隔开的节点id，或特殊占位符<code>$-.id</code>(参看<code>PIPE</code>用法)。</li>
<li><edge_type_list>为图遍历返回的边类型列表。</li>
<li>WHERE <filter_list> 指定被筛选的逻辑条件，WHERE可用于起点，边及终点，同样支持逻辑关键词
AND，OR，NOT，详情参见WHERE的用法。</li>
<li>YIELD [DISTINCT] <return_list>以列的形式返回结果，并可对列进行重命名。详情参看<code>YIELD</code>
用法。<code>DISTINCT</code>的用法与SQL相同。</li>
</ul>
<h3 id="_1">示例<a class="headerlink" href="#_1" title="Permanent link">&para;</a></h3>
<div class="codehilite"><pre><span></span>nebula&gt; GO FROM 101 OVER serve  \
   /* 从点101出发，沿边serve，找到点204，215 */
=======
| id  |
=======
| 204 |
-------
| 215 |
-------
</pre></div>


<div class="codehilite"><pre><span></span>nebula&gt; GO FROM 101 OVER serve  \
   WHERE serve.start_year &gt; 1990       /* 筛选边serve的start_year属性  */ \
   YIELD $$.team.name AS team_name,    /* 目标点team的serve.start_year属性 serve.start_year */
================================
| team_name | serve.start_year |
================================
| Spurs     | 1999             |
-------------------------------- 
| Hornets   | 2018             | 
--------------------------------   
</pre></div>


<div class="codehilite"><pre><span></span>nebula&gt; GO FROM 100,102 OVER serve           \
   WHERE serve.start_year &gt; 1995             /* 筛选边属性*/ \
   YIELD DISTINCT $$.team.name AS team_name, /* DISTINCT与SQL用法相同 */ \
   serve.start_year,                         /* 边属性 */ \
   $^.player.name AS player_name             /* 起点(player)属性 */
========================================================
| team_name     | serve.start_year | player_name       |
========================================================
| Trail Blazers | 2006             | LaMarcus Aldridge |
--------------------------------------------------------
| Spurs         | 2015             | LaMarcus Aldridge |
--------------------------------------------------------
| Spurs         | 1997             | Tim Duncan        |
--------------------------------------------------------   
</pre></div>


<h3 id="_2">参考<a class="headerlink" href="#_2" title="Permanent link">&para;</a></h3>
                
                  
                
              
              
                


              
            </article>
          </div>
        </div>
      </main>
      
        
<footer class="md-footer">
  
    <div class="md-footer-nav">
      <nav class="md-footer-nav__inner md-grid">
        
          <a href="../fetch_Syntax/" title="Fetch syntax" class="md-flex md-footer-nav__link md-footer-nav__link--prev" rel="prev">
            <div class="md-flex__cell md-flex__cell--shrink">
              <i class="md-icon md-icon--arrow-back md-footer-nav__button"></i>
            </div>
            <div class="md-flex__cell md-flex__cell--stretch md-footer-nav__title">
              <span class="md-flex__ellipsis">
                <span class="md-footer-nav__direction">
                  后退
                </span>
                Fetch syntax
              </span>
            </div>
          </a>
        
        
          <a href="../INSERT_VERTEX_Syntax/" title="Insert vertex syntax" class="md-flex md-footer-nav__link md-footer-nav__link--next" rel="next">
            <div class="md-flex__cell md-flex__cell--stretch md-footer-nav__title">
              <span class="md-flex__ellipsis">
                <span class="md-footer-nav__direction">
                  前进
                </span>
                Insert vertex syntax
              </span>
            </div>
            <div class="md-flex__cell md-flex__cell--shrink">
              <i class="md-icon md-icon--arrow-forward md-footer-nav__button"></i>
            </div>
          </a>
        
      </nav>
    </div>
  
  <div class="md-footer-meta md-typeset">
    <div class="md-footer-meta__inner md-grid">
      <div class="md-footer-copyright">
        
          <div class="md-footer-copyright__highlight">
            Copyright &copy; 2018 - 2019 Nebula Graph
          </div>
        
        powered by
        <a href="https://www.mkdocs.org">MkDocs</a>
        and
        <a href="https://squidfunk.github.io/mkdocs-material/">
          Material for MkDocs</a>
      </div>
      
  <div class="md-footer-social">
    <link rel="stylesheet" href="../../../../assets/fonts/font-awesome.css">
    
      <a href="https://github.com/vesoft-inc/nebula" class="md-footer-social__link fa fa-github"></a>
    
      <a href="https://www.weibo.com/u/7122684542?is_hot=1" class="md-footer-social__link fa fa-weibo"></a>
    
  </div>

    </div>
  </div>
</footer>
      
    </div>
    
      <script src="../../../../assets/javascripts/application.39abc4af.js"></script>
      
        
        
          
          <script src="../../../../assets/javascripts/lunr/lunr.stemmer.support.js"></script>
          
            
              
                <script src="../../../../assets/javascripts/lunr/tinyseg.js"></script>
              
              
                <script src="../../../../assets/javascripts/lunr/lunr.ja.js"></script>
              
            
          
          
        
      
      <script>app.initialize({version:"1.0.4",url:{base:"../../../.."}})</script>
      
    
  </body>
</html>