



<!doctype html>
<html lang="zh" class="no-js">
  <head>
    
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width,initial-scale=1">
      <meta http-equiv="x-ua-compatible" content="ie=edge">
      
        <meta name="description" content="Documentation for Nebula Graph">
      
      
        <link rel="canonical" href="http://docs.nebula-graph.io/cn-doc/cn-get-started/">
      
      
        <meta name="author" content="Nebula Graph">
      
      
        <meta name="lang:clipboard.copy" content="复制">
      
        <meta name="lang:clipboard.copied" content="已复制">
      
        <meta name="lang:search.language" content="ja">
      
        <meta name="lang:search.pipeline.stopwords" content="True">
      
        <meta name="lang:search.pipeline.trimmer" content="True">
      
        <meta name="lang:search.result.none" content="没有找到符合条件的结果">
      
        <meta name="lang:search.result.one" content="找到 1 个符合条件的结果">
      
        <meta name="lang:search.result.other" content="# 个符合条件的结果">
      
        <meta name="lang:search.tokenizer" content="[\uff0c\u3002]+">
      
      <link rel="shortcut icon" href="../../images/favicon.ico">
      <meta name="generator" content="mkdocs-1.0.4, mkdocs-material-4.2.0">
    
    
      
        <title>Getting Started - Nebula Graph Docs</title>
      
    
    
      <link rel="stylesheet" href="../../assets/stylesheets/application.750b69bd.css">
      
        <link rel="stylesheet" href="../../assets/stylesheets/application-palette.224b79ff.css">
      
      
        
        
        <meta name="theme-color" content="#3f51b5">
      
    
    
      <script src="../../assets/javascripts/modernizr.74668098.js"></script>
    
    
      
        <link href="https://fonts.gstatic.com" rel="preconnect" crossorigin>
        <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto:300,400,400i,700|Roboto+Mono">
        <style>body,input{font-family:"Roboto","Helvetica Neue",Helvetica,Arial,sans-serif}code,kbd,pre{font-family:"Roboto Mono","Courier New",Courier,monospace}</style>
      
    
    <link rel="stylesheet" href="../../assets/fonts/material-icons.css">
    
    
    
      
    
    
  </head>
  
    
    
    <body dir="ltr" data-md-color-primary="indigo" data-md-color-accent="indigo">
  
    <svg class="md-svg">
      <defs>
        
        
          <svg xmlns="http://www.w3.org/2000/svg" width="416" height="448"
    viewBox="0 0 416 448" id="__github">
  <path fill="currentColor" d="M160 304q0 10-3.125 20.5t-10.75 19-18.125
        8.5-18.125-8.5-10.75-19-3.125-20.5 3.125-20.5 10.75-19 18.125-8.5
        18.125 8.5 10.75 19 3.125 20.5zM320 304q0 10-3.125 20.5t-10.75
        19-18.125 8.5-18.125-8.5-10.75-19-3.125-20.5 3.125-20.5 10.75-19
        18.125-8.5 18.125 8.5 10.75 19 3.125 20.5zM360
        304q0-30-17.25-51t-46.75-21q-10.25 0-48.75 5.25-17.75 2.75-39.25
        2.75t-39.25-2.75q-38-5.25-48.75-5.25-29.5 0-46.75 21t-17.25 51q0 22 8
        38.375t20.25 25.75 30.5 15 35 7.375 37.25 1.75h42q20.5 0
        37.25-1.75t35-7.375 30.5-15 20.25-25.75 8-38.375zM416 260q0 51.75-15.25
        82.75-9.5 19.25-26.375 33.25t-35.25 21.5-42.5 11.875-42.875 5.5-41.75
        1.125q-19.5 0-35.5-0.75t-36.875-3.125-38.125-7.5-34.25-12.875-30.25-20.25-21.5-28.75q-15.5-30.75-15.5-82.75
        0-59.25 34-99-6.75-20.5-6.75-42.5 0-29 12.75-54.5 27 0 47.5 9.875t47.25
        30.875q36.75-8.75 77.25-8.75 37 0 70 8 26.25-20.5
        46.75-30.25t47.25-9.75q12.75 25.5 12.75 54.5 0 21.75-6.75 42 34 40 34
        99.5z" />
</svg>
        
      </defs>
    </svg>
    <input class="md-toggle" data-md-toggle="drawer" type="checkbox" id="__drawer" autocomplete="off">
    <input class="md-toggle" data-md-toggle="search" type="checkbox" id="__search" autocomplete="off">
    <label class="md-overlay" data-md-component="overlay" for="__drawer"></label>
    
      <a href="#nebula-graph" tabindex="1" class="md-skip">
        跳转至
      </a>
    
    
      <header class="md-header" data-md-component="header">
  <nav class="md-header-nav md-grid">
    <div class="md-flex">
      <div class="md-flex__cell md-flex__cell--shrink">
        <a href="http://docs.nebula-graph.io/" title="Nebula Graph Docs" class="md-header-nav__button md-logo">
          
            <i class="md-icon">library_books</i>
          
        </a>
      </div>
      <div class="md-flex__cell md-flex__cell--shrink">
        <label class="md-icon md-icon--menu md-header-nav__button" for="__drawer"></label>
      </div>
      <div class="md-flex__cell md-flex__cell--stretch">
        <div class="md-flex__ellipsis md-header-nav__title" data-md-component="title">
          
            <span class="md-header-nav__topic">
              Nebula Graph Docs
            </span>
            <span class="md-header-nav__topic">
              Getting Started
            </span>
          
        </div>
      </div>
      <div class="md-flex__cell md-flex__cell--shrink">
        
          <label class="md-icon md-icon--search md-header-nav__button" for="__search"></label>
          
<div class="md-search" data-md-component="search" role="dialog">
  <label class="md-search__overlay" for="__search"></label>
  <div class="md-search__inner" role="search">
    <form class="md-search__form" name="search">
      <input type="text" class="md-search__input" name="query" placeholder="搜索" autocapitalize="off" autocorrect="off" autocomplete="off" spellcheck="false" data-md-component="query" data-md-state="active">
      <label class="md-icon md-search__icon" for="__search"></label>
      <button type="reset" class="md-icon md-search__icon" data-md-component="reset" tabindex="-1">
        &#xE5CD;
      </button>
    </form>
    <div class="md-search__output">
      <div class="md-search__scrollwrap" data-md-scrollfix>
        <div class="md-search-result" data-md-component="result">
          <div class="md-search-result__meta">
            键入以开始搜索
          </div>
          <ol class="md-search-result__list"></ol>
        </div>
      </div>
    </div>
  </div>
</div>
        
      </div>
      
        <div class="md-flex__cell md-flex__cell--shrink">
          <div class="md-header-nav__source">
            


  

<a href="https://github.com/vesoft-inc/nebula/" title="前往 Github 仓库" class="md-source" data-md-source="github">
  
    <div class="md-source__icon">
      <svg viewBox="0 0 24 24" width="24" height="24">
        <use xlink:href="#__github" width="24" height="24"></use>
      </svg>
    </div>
  
  <div class="md-source__repository">
    vesoft-inc/nebula
  </div>
</a>
          </div>
        </div>
      
    </div>
  </nav>
</header>
    
    <div class="md-container">
      
        
      
      
        

  

<nav class="md-tabs md-tabs--active" data-md-component="tabs">
  <div class="md-tabs__inner md-grid">
    <ul class="md-tabs__list">
      
        
  
  
    <li class="md-tabs__item">
      
        <a href="../cn-README/" title="Home" class="md-tabs__link md-tabs__link--active">
          Home
        </a>
      
    </li>
  

      
        
  
  
    
    
  
  
    <li class="md-tabs__item">
      
        <a href="../../cn-manual-doc/Language_Structure/Comment_Syntax/" title="Manual" class="md-tabs__link">
          Manual
        </a>
      
    </li>
  

  

      
    </ul>
  </div>
</nav>
      
      <main class="md-main">
        <div class="md-main__inner md-grid" data-md-component="container">
          
            
              <div class="md-sidebar md-sidebar--primary" data-md-component="navigation">
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    <nav class="md-nav md-nav--primary" data-md-level="0">
  <label class="md-nav__title md-nav__title--site" for="__drawer">
    <a href="http://docs.nebula-graph.io/" title="Nebula Graph Docs" class="md-nav__button md-logo">
      
        <i class="md-icon">library_books</i>
      
    </a>
    Nebula Graph Docs
  </label>
  
    <div class="md-nav__source">
      


  

<a href="https://github.com/vesoft-inc/nebula/" title="前往 Github 仓库" class="md-source" data-md-source="github">
  
    <div class="md-source__icon">
      <svg viewBox="0 0 24 24" width="24" height="24">
        <use xlink:href="#__github" width="24" height="24"></use>
      </svg>
    </div>
  
  <div class="md-source__repository">
    vesoft-inc/nebula
  </div>
</a>
    </div>
  
  <ul class="md-nav__list" data-md-scrollfix>
    
      
      
      

  


  <li class="md-nav__item md-nav__item--active md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-1" type="checkbox" id="nav-1" checked>
    
    <label class="md-nav__link" for="nav-1">
      Home
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-1">
        Home
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../cn-README/" title="Overview" class="md-nav__link">
      Overview
    </a>
  </li>

        
          
          
          

  


  <li class="md-nav__item md-nav__item--active">
    
    <input class="md-toggle md-nav__toggle" data-md-toggle="toc" type="checkbox" id="__toc">
    
    
      <label class="md-nav__link md-nav__link--active" for="__toc">
        Getting Started
      </label>
    
    <a href="./" title="Getting Started" class="md-nav__link md-nav__link--active">
      Getting Started
    </a>
    
      
<nav class="md-nav md-nav--secondary">
  
  
  
    <label class="md-nav__title" for="__toc">目录</label>
    <ul class="md-nav__list" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#nebula-graph" title="安装Nebula Graph" class="md-nav__link">
    安装Nebula Graph
  </a>
  
    <nav class="md-nav">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#docker" title="通过Docker" class="md-nav__link">
    通过Docker
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#linux" title="编译源码(Linux)" class="md-nav__link">
    编译源码(Linux)
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#_1" title="创建图数据" class="md-nav__link">
    创建图数据
  </a>
  
    <nav class="md-nav">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#_2" title="创建图空间" class="md-nav__link">
    创建图空间
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#schema" title="定义图数据Schema" class="md-nav__link">
    定义图数据Schema
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_3" title="插入数据" class="md-nav__link">
    插入数据
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#_4" title="示例查询" class="md-nav__link">
    示例查询
  </a>
  
</li>
      
      
      
      
      
    </ul>
  
</nav>
    
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../cn-how-to-contribute/" title="Contribute to Nebula" class="md-nav__link">
      Contribute to Nebula
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../cn-contribute-to-documentation/" title="Contribute to Docs" class="md-nav__link">
      Contribute to Docs
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2" type="checkbox" id="nav-2">
    
    <label class="md-nav__link" for="nav-2">
      Manual
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-2">
        Manual
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-1" type="checkbox" id="nav-2-1">
    
    <label class="md-nav__link" for="nav-2-1">
      Language structure
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-2-1">
        Language structure
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/Language_Structure/Comment_Syntax/" title="Comment syntax" class="md-nav__link">
      Comment syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/Language_Structure/Identifier_Case_Sensitivity/" title="Identifier" class="md-nav__link">
      Identifier
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/Language_Structure/Property_Reference/" title="Property reference" class="md-nav__link">
      Property reference
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/Language_Structure/Schema_Object_Names/" title="Schema object names" class="md-nav__link">
      Schema object names
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/Language_Structure/Statement_Composition/" title="Statement composition" class="md-nav__link">
      Statement composition
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-2" type="checkbox" id="nav-2-2">
    
    <label class="md-nav__link" for="nav-2-2">
      Statement syntax
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-2-2">
        Statement syntax
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-2-1" type="checkbox" id="nav-2-2-1">
    
    <label class="md-nav__link" for="nav-2-2-1">
      Data administration statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-2-2-1">
        Data administration statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-2-1-1" type="checkbox" id="nav-2-2-1-1">
    
    <label class="md-nav__link" for="nav-2-2-1-1">
      Account management statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="4">
      <label class="md-nav__title" for="nav-2-2-1-1">
        Account management statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/cn_Statement_Syntax/cn_Data_Administration_Statements/cn_Account_Management_Statements/Drop_User_Syntax/" title="Drop user syntax" class="md-nav__link">
      Drop user syntax
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-2-1-2" type="checkbox" id="nav-2-2-1-2">
    
    <label class="md-nav__link" for="nav-2-2-1-2">
      Configuration statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="4">
      <label class="md-nav__title" for="nav-2-2-1-2">
        Configuration statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/cn_Statement_Syntax/cn_Data_Administration_Statements/cn_Configuration_Statements/cn_Variables_Syntax/" title="Variables syntax" class="md-nav__link">
      Variables syntax
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-2-2" type="checkbox" id="nav-2-2-2">
    
    <label class="md-nav__link" for="nav-2-2-2">
      Data definition statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-2-2-2">
        Data definition statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/cn_Statement_Syntax/cn_Data_Definition_Statements/cn_Alter_Tag_Edge_Syntax/" title="Alter tag edge syntax" class="md-nav__link">
      Alter tag edge syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/cn_Statement_Syntax/cn_Data_Definition_Statements/Create_Space_Syntax/" title="Create space syntax" class="md-nav__link">
      Create space syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/cn_Statement_Syntax/cn_Data_Definition_Statements/Create_Tag_Edge_Syntax/" title="Create tag edge syntax" class="md-nav__link">
      Create tag edge syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/cn_Statement_Syntax/cn_Data_Definition_Statements/Drop_Edge_Syntax/" title="Drop edge syntax" class="md-nav__link">
      Drop edge syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/cn_Statement_Syntax/cn_Data_Definition_Statements/Drop_Space_Syntax/" title="Drop space syntax" class="md-nav__link">
      Drop space syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/cn_Statement_Syntax/cn_Data_Definition_Statements/Drop_Tag_Syntax/" title="Drop tage syntax" class="md-nav__link">
      Drop tage syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/cn_Statement_Syntax/cn_Data_Definition_Statements/Show_Syntax/" title="Show syntax" class="md-nav__link">
      Show syntax
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-2-3" type="checkbox" id="nav-2-2-3">
    
    <label class="md-nav__link" for="nav-2-2-3">
      Data manipulation statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-2-2-3">
        Data manipulation statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/cn_Statement_Syntax/DATA_Manipulation_Statements/fetch_Syntax/" title="Fetch syntax" class="md-nav__link">
      Fetch syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/cn_Statement_Syntax/DATA_Manipulation_Statements/Go_Syntax/" title="Go syntax" class="md-nav__link">
      Go syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../docs/cn-manual-doc/cn_Statement_Syntax/DATA_Manipulation_Statements/INSERT_EDGE_Syntax.md" title="Insert edge syntax" class="md-nav__link">
      Insert edge syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/cn_Statement_Syntax/DATA_Manipulation_Statements/INSERT_VERTEX_Syntax/" title="Insert vertex syntax" class="md-nav__link">
      Insert vertex syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/cn_Statement_Syntax/DATA_Manipulation_Statements/PIPE_Syntax/" title="Pipe syntax" class="md-nav__link">
      Pipe syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/cn_Statement_Syntax/DATA_Manipulation_Statements/WHERE_Syntax/" title="Where syntax" class="md-nav__link">
      Where syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../cn-manual-doc/cn_Statement_Syntax/DATA_Manipulation_Statements/YIELD_Syntax/" title="Yield syntax" class="md-nav__link">
      Yield syntax
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

    
  </ul>
</nav>
                  </div>
                </div>
              </div>
            
            
              <div class="md-sidebar md-sidebar--secondary" data-md-component="toc">
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    
<nav class="md-nav md-nav--secondary">
  
  
  
    <label class="md-nav__title" for="__toc">目录</label>
    <ul class="md-nav__list" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#nebula-graph" title="安装Nebula Graph" class="md-nav__link">
    安装Nebula Graph
  </a>
  
    <nav class="md-nav">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#docker" title="通过Docker" class="md-nav__link">
    通过Docker
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#linux" title="编译源码(Linux)" class="md-nav__link">
    编译源码(Linux)
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#_1" title="创建图数据" class="md-nav__link">
    创建图数据
  </a>
  
    <nav class="md-nav">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#_2" title="创建图空间" class="md-nav__link">
    创建图空间
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#schema" title="定义图数据Schema" class="md-nav__link">
    定义图数据Schema
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_3" title="插入数据" class="md-nav__link">
    插入数据
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#_4" title="示例查询" class="md-nav__link">
    示例查询
  </a>
  
</li>
      
      
      
      
      
    </ul>
  
</nav>
                  </div>
                </div>
              </div>
            
          
          <div class="md-content">
            <article class="md-content__inner md-typeset">
              
                
                  <a href="https://github.com/vesoft-inc/nebula/edit/master/docs/cn-doc/cn-get-started.md" title="编辑此页" class="md-icon md-content__icon">&#xE3C9;</a>
                
                
                  <h1>Getting Started</h1>
                
                <hr />
<p>本教程旨在对 <strong>Nebula Graph</strong> 的使用做简要介绍。</p>
<h2 id="nebula-graph">安装Nebula Graph<a class="headerlink" href="#nebula-graph" title="Permanent link">&para;</a></h2>
<h3 id="docker">通过Docker<a class="headerlink" href="#docker" title="Permanent link">&para;</a></h3>
<p>启动 <strong>Nebula Graph</strong> 最快捷的方式是使用<code>docker</code>。首先，查看电脑是否已安装Docker：</p>
<div class="codehilite"><pre><span></span>&gt; docker --version
Docker version 18.09.2, build 6247962
</pre></div>


<p>如果未安装，参看<a href="https://docs.docker.com/install/">这里</a>。
安装之后，运行：</p>
<div class="codehilite"><pre><span></span>&gt; docker pull vesoft/nebula-graph:latest
ac9208207ada: Pulling fs layer
cdcb67189ff7: Pulling fs layer
80407c3cb6b4: Pulling fs layer
latest: Pulling from vesoft/nebula-graph
ac9208207ada: Pull complete
cdcb67189ff7: Pull complete
80407c3cb6b4: Pull complete
Digest: sha256:72a73c801685595776779291969b57ab758f53ebd9bda8bab56421e50bfee161
Status: Downloaded newer image for vesoft/nebula-graph:latest
</pre></div>


<p>下载Nebula镜像。</p>
<p>国内从 Docker Hub 拉取镜像有时会遇到困难，此时可以配置国内地址。例如:</p>
<ul>
<li>Azure 中国镜像 https://dockerhub.azk8s.cn</li>
<li>七牛云 https://reg-mirror.qiniu.com</li>
</ul>
<p>linux用户请在/etc/docker/daemon.json 中写入如下内容（如果文件不存在请新建该文件</p>
<div class="codehilite"><pre><span></span>{
  &quot;registry-mirrors&quot;: [
    &quot;https://dockerhub.azk8s.cn&quot;,
    &quot;https://reg-mirror.qiniu.com&quot;
  ]
}
</pre></div>


<p>macOS 用户请点击任务栏中Docker Desktop图标 -&gt; Preferences -&gt; Daemon -&gt; Registry mirrors。 在列表中添加 https://dockerhub.azk8s.cn 和 https://reg-mirror.qiniu.com。修改完成后，点击 Apply &amp; Restart 按钮， 重启Docker。</p>
<p>镜像下载完成后，键入命令<code>docker images</code>查看下载完成的镜像。</p>
<div class="codehilite"><pre><span></span>&gt; docker images
REPOSITORY            TAG                 IMAGE ID            CREATED             SIZE
vesoft/nebula-graph   latest              1afd60e223ca        4 weeks ago         401MB
</pre></div>


<!-- If `docker` is slow when pulling the image, configure a new mirror.

You can add the source at `/etc/docker/daemon.json`, for Linux users:


<div class="codehilite"><pre><span></span>{
  &quot;registry-mirrors&quot;: [
    &quot;https://dockerhub.azk8s.cn&quot;,
    &quot;https://reg-mirror.qiniu.com&quot;
  ]
}
</pre></div>



For macOS users, click the Docker Desktop icon -> Preferences -> Daemon -> Registry mirrors. Add https://dockerhub.azk8s.cn and https://reg-mirror.qiniu.com to the list. Once the modification is complete, click the Apply & Restart button to restart Docker. -->

<hr />
<p><strong>运行 Nebula Graph</strong></p>
<p><code>nebula</code> 镜像下载完成后，运行</p>
<div class="codehilite"><pre><span></span>&gt; docker run -it vesoft/nebula-graph:latest /bin/bash
</pre></div>


<p>启动docker容器。</p>
<p>进入容器后，默认在根目录下<code>/</code>，使用<code>/usr/local/nebula/script/</code>切换到<code>neula</code>主目录。</p>
<p>运行</p>
<div class="codehilite"><pre><span></span>&gt; ./start-all.sh
Starting MetaService StorageService and GraphService ...
</pre></div>


<p>启动测试服务，存储服务和图服务。</p>
<p>运行</p>
<div class="codehilite"><pre><span></span>&gt; ps -ef | grep nebula
</pre></div>


<p>查看服务进程，，如果看到nebula-metad, nebula-storaged,  nebula-graphd ，则表明服务已成功连接。</p>
<!-- `bin/nebula` is a `console` which can be used to insert and query data.

`--port` is used for specifying the graph server port and the default value is `3699`.

`-u` and `-p` are used to specify the user name and password, `user` and `password` are the default authority.

Run


<div class="codehilite"><pre><span></span> &gt; bin/nebula --port=3699 -u=user -p=password
</pre></div>



to connect to the graph server. -->

<p>运行以下命令连接nebula</p>
<div class="codehilite"><pre><span></span>&gt; ./start-console.sh

Welcome to Nebula Graph (Version 0.1)

nebula&gt;
</pre></div>


<p>如果对部署过程有任何问题，欢迎在<a href="https://github.com/vesoft-inc/nebula/issues">GitHub</a>上提issue。</p>
<h3 id="linux">编译源码(Linux)<a class="headerlink" href="#linux" title="Permanent link">&para;</a></h3>
<p><strong>依赖</strong></p>
<p>nebula遵循c++14标准，依赖第三方库：</p>
<ul>
<li>autoconf</li>
<li>automake</li>
<li>libtool</li>
<li>cmake</li>
<li>bison</li>
<li>unzip</li>
<li>boost</li>
<li>gperf</li>
<li>krb5</li>
<li>openssl</li>
<li>libunwind</li>
<li>ncurses</li>
<li>readline</li>
</ul>
<p>建议安装g++ 5以上linux系统, 比如Fedora 29。目前，nebula使用<code>git-lfs</code>存储第三方库，请确保获取源代码之前您已安装<code>git-lfs</code>。</p>
<p><strong>从GitHub获取源码</strong></p>
<div class="codehilite"><pre><span></span>&gt; git clone https://github.com/vesoft-inc/nebula.git
</pre></div>


<p><strong>编译</strong></p>
<div class="codehilite"><pre><span></span>&gt; cmake ./
</pre></div>


<p>默认安装到 /usr/local路径，如需指定安装路径，请使用:</p>
<div class="codehilite"><pre><span></span>&gt; cmake -DCMAKE_INSTALL_PREFIX=$your_nebula_install_dir
</pre></div>


<p>替换此处的 <code>$your_nebula_install_dir</code>。</p>
<p>然后运行以下命令：</p>
<div class="codehilite"><pre><span></span>&gt; make &amp;&amp; make install
</pre></div>


<p><strong>运行nebula（单机）</strong></p>
<p>配置nebula-metad.conf</p>
<p>在nebula安装目录下，运行以下命令：</p>
<div class="codehilite"><pre><span></span>&gt; cp etc/nebula-metad.conf.default etc/nebula-metad.conf
</pre></div>


<p>根据实际修改nebula-metad.conf中的配置：</p>
<ul>
<li>local_ip ip地址</li>
<li>port 端口号</li>
<li>ws_http_port metaservice HTTP HTTP服务端口号</li>
<li>ws_h2_port metaservice HTTP2服务端口号</li>
</ul>
<p>配置nebula-storaged.conf</p>
<div class="codehilite"><pre><span></span>&gt; cp etc/nebula-storaged.conf.default etc/nebula-storaged.conf
</pre></div>


<p>根据实际修改nebula-storaged.conf中的配置：</p>
<ul>
<li>local_ip ip地址</li>
<li>port 端口号</li>
<li>ws_http_port storageservice HTTP服务端口号</li>
<li>ws_h2_port storageservice HTTP2服务端口号</li>
</ul>
<p>根据实际修改nebula-graphd.conf中的配置：</p>
<div class="codehilite"><pre><span></span>&gt; cp etc/nebula-graphd.conf.default etc/nebula-graphd.conf
</pre></div>


<ul>
<li>local_ip ip地址</li>
<li>port 端口号</li>
<li>ws_http_port graphservice HTTP服务端口号</li>
<li>ws_h2_port graphservice HTTP2服务端口号</li>
</ul>
<p><strong>启动服务</strong></p>
<div class="codehilite"><pre><span></span>&gt; scripts/nebula.service start all
</pre></div>


<p>查看服务状态</p>
<div class="codehilite"><pre><span></span>&gt; scripts/nebula.service status all
</pre></div>


<p><strong>连接nebula</strong></p>
<div class="codehilite"><pre><span></span>&gt; bin/nebula -u=user -p=password
</pre></div>


<ul>
<li>-u为用户名，默认值为<code>user</code></li>
<li>-p为密码，用户<code>user</code>的默认密码为<code>password</code></li>
</ul>
<p><code>ADD HOSTS</code>将存储节点注册到元数据服务中</p>
<div class="codehilite"><pre><span></span>&gt; ADD HOSTS $storage_ip:$storage_port
</pre></div>


<p>根据nebula-storaged.conf中的<code>local_ip</code>， <code>port</code> 替换此处的<code>$storage_ip</code>，<code>$storage_port</code>。</p>
<hr />
<h2 id="_1">创建图数据<a class="headerlink" href="#_1" title="Permanent link">&para;</a></h2>
<p>本节介绍如何构建图数据并进行查询。本示例基于下图构建：</p>
<p><img alt="Untitled Diagram (1)" src="https://user-images.githubusercontent.com/51590253/60649144-0774c980-9e74-11e9-86d6-bad1653e70ba.png" /></p>
<p>示例数据有三种类型的标签（<em>course</em>， <em>building</em>，<em>student</em>），两种类型的边（<em>select</em> 和 <em>like</em>），其schema为：</p>
<div class="codehilite"><pre><span></span><span class="p">{</span>  
   <span class="nt">&quot;tags&quot;</span><span class="p">:{</span>  
      <span class="nt">&quot;course&quot;</span><span class="p">:[</span>  
         <span class="s2">&quot;name: string&quot;</span><span class="p">,</span>
         <span class="s2">&quot;credits: integer&quot;</span>
      <span class="p">],</span>
      <span class="nt">&quot;building&quot;</span><span class="p">:[</span>  
         <span class="s2">&quot;name: string&quot;</span>
      <span class="p">],</span>
      <span class="nt">&quot;student&quot;</span><span class="p">:[</span>  
         <span class="s2">&quot;name: string&quot;</span><span class="p">,</span>
         <span class="s2">&quot;age: integer&quot;</span><span class="p">,</span>
         <span class="s2">&quot;gender: string&quot;</span>
      <span class="p">]</span>
   <span class="p">},</span>
   <span class="nt">&quot;edges&quot;</span><span class="p">:{</span>  
      <span class="nt">&quot;select&quot;</span><span class="p">:[</span>  
         <span class="s2">&quot;grade: integer&quot;</span>
      <span class="p">],</span>
      <span class="nt">&quot;like&quot;</span><span class="p">:[</span>  
         <span class="s2">&quot;likeness: double&quot;</span>
      <span class="p">]</span>
   <span class="p">}</span>
<span class="p">}</span>
</pre></div>


<h3 id="_2">创建图空间<a class="headerlink" href="#_2" title="Permanent link">&para;</a></h3>
<p>nebula中的图存储于 <strong>SPACE</strong> 中，每个space是一个物理隔离的空间。首先，需要创建一个space，然后指定使用该space以完成之后的操作。</p>
<p>列出已有的space：</p>
<div class="codehilite"><pre><span></span>nebula&gt; SHOW SPACES;
</pre></div>


<p>创建一个名为myspace_test2的新space：</p>
<div class="codehilite"><pre><span></span>nebula&gt; CREATE SPACE myspace_test2(partition_num=1, replica_factor=1);

-- 使用这个space
nebula&gt; USE myspace_test2;
</pre></div>


<p><code>replica_factor</code> 用来指定集群复本数。</p>
<p><code>partition_num</code> 用来指定一个复本中的分区数量。</p>
<h3 id="schema">定义图数据Schema<a class="headerlink" href="#schema" title="Permanent link">&para;</a></h3>
<p>使用<code>CREATE TAG</code>语句定义带有标签类型和属性列表的标签。</p>
<div class="codehilite"><pre><span></span>nebula&gt; CREATE TAG course(name string, credits int);
nebula&gt; CREATE TAG building(name string);
nebula&gt; CREATE TAG student(name string, age int, gender string);
</pre></div>


<p>使用<code>CREATE EDGE</code>语句定义边类型。</p>
<div class="codehilite"><pre><span></span>nebula&gt; CREATE EDGE like(likeness double);
nebula&gt; CREATE EDGE select(grade int);
</pre></div>


<p>查看上述创建的标签和边：</p>
<div class="codehilite"><pre><span></span>-- 查看标签列表
nebula&gt; SHOW TAGS;

-- 查看边列表
nebula&gt; SHOW EDGES;
</pre></div>


<p>查看标签或边的属性</p>
<div class="codehilite"><pre><span></span>-- 查看标签属性
nebula&gt; DESCRIBE TAG student;

-- 查看边属性
nebula&gt; DESCRIBE EDGE like;
</pre></div>


<h3 id="_3">插入数据<a class="headerlink" href="#_3" title="Permanent link">&para;</a></h3>
<p>为上述图数据插入点和边。</p>
<div class="codehilite"><pre><span></span>-- 插入点
nebula&gt; INSERT VERTEX student(name, age, gender) VALUES 200:(&quot;Monica&quot;, 16, &quot;female&quot;);
nebula&gt; INSERT VERTEX student(name, age, gender) VALUES 201:(&quot;Mike&quot;, 18, &quot;male&quot;);
nebula&gt; INSERT VERTEX student(name, age, gender) VALUES 202:(&quot;Jane&quot;, 17, &quot;female&quot;);
nebula&gt; INSERT VERTEX course(name, credits),building(name) VALUES 101:(&quot;Math&quot;, 3, &quot;No5&quot;);
nebula&gt; INSERT VERTEX course(name, credits),building(name) VALUES 102:(&quot;English&quot;, 6, &quot;No11&quot;);
</pre></div>


<div class="codehilite"><pre><span></span>-- 插入边
nebula&gt; INSERT EDGE select(grade) VALUES 200 -&gt; 101:(5);
nebula&gt; INSERT EDGE select(grade) VALUES 200 -&gt; 102:(3);
nebula&gt; INSERT EDGE select(grade) VALUES 201 -&gt; 102:(3);
nebula&gt; INSERT EDGE select(grade) VALUES 202 -&gt; 102:(3);
nebula&gt; INSERT EDGE like(likeness) VALUES 200 -&gt; 201:(92.5);
nebula&gt; INSERT EDGE like(likeness) VALUES 201 -&gt; 200:(85.6);
nebula&gt; INSERT EDGE like(likeness) VALUES 201 -&gt; 202:(93.2);
</pre></div>


<h2 id="_4">示例查询<a class="headerlink" href="#_4" title="Permanent link">&para;</a></h2>
<p>Q1. 查询点201喜欢的点：</p>
<div class="codehilite"><pre><span></span>nebula&gt; GO FROM 201 OVER like;

=======
|  id |
=======
| 200 |
-------
| 202 |
-------
</pre></div>


<p>Q2. 查询点201喜欢的点，并筛选出年龄大于17岁的点，并返回其姓名，年龄，性别，将其重全名为Friend，Age，Gender。</p>
<div class="codehilite"><pre><span></span>nebula&gt; GO FROM 201 OVER like WHERE $$.student.age &gt;= 17 YIELD $$.student.name AS Friend, $$.student.age AS Age, $$.student.gender AS Gender;

=========================
| Friend | Age | Gender |
=========================
|   Jane |  17 | female |
-------------------------
</pre></div>


<p><code>YIELD</code>用来指定目标返回值。</p>
<p><code>$^</code>为起始点。</p>
<p><code>$$</code> 为目标点。</p>
<p>Q3. 查询点201喜欢的点选择了哪些课程和其对应年级。</p>
<div class="codehilite"><pre><span></span>-- 使用管道
nebula&gt; GO FROM 201 OVER like | GO FROM $-.id OVER select YIELD $^.student.name AS Student, $$.course.name AS Course, select.grade AS Grade;

=============================
| Student |  Course | Grade |
=============================
|  Monica |    Math |     5 |
-----------------------------
|  Monica | English |     3 |
-----------------------------
|    Jane | English |     3 |
-----------------------------

-- 使用临时变量
nebula&gt; $a=GO FROM 201 OVER like; GO FROM $a.id OVER select YIELD $^.student.name AS Student, $$.course.name AS Course, select.grade AS Grade;

=============================
| Student |  Course | Grade |
=============================
|  Monica |    Math |     5 |
-----------------------------
|  Monica | English |     3 |
-----------------------------
|    Jane | English |     3 |
-----------------------------
</pre></div>


<p><code>|</code> 表示管道，上一个查询的输出可作为下一个管道的输入。</p>
<p><code>$-</code> 表示输入流。</p>
<p>第二种方法使用了用户定义变量<code>$a</code>，此变量仅适用于复合语句。</p>
<!-- 有关查询语言的更多详细信息，请查看check [nGQL Query Language](nGQL-tutorial.md)。 -->
                
                  
                
              
              
                


              
            </article>
          </div>
        </div>
      </main>
      
        
<footer class="md-footer">
  
    <div class="md-footer-nav">
      <nav class="md-footer-nav__inner md-grid">
        
          <a href="../cn-README/" title="Overview" class="md-flex md-footer-nav__link md-footer-nav__link--prev" rel="prev">
            <div class="md-flex__cell md-flex__cell--shrink">
              <i class="md-icon md-icon--arrow-back md-footer-nav__button"></i>
            </div>
            <div class="md-flex__cell md-flex__cell--stretch md-footer-nav__title">
              <span class="md-flex__ellipsis">
                <span class="md-footer-nav__direction">
                  后退
                </span>
                Overview
              </span>
            </div>
          </a>
        
        
          <a href="../cn-how-to-contribute/" title="Contribute to Nebula" class="md-flex md-footer-nav__link md-footer-nav__link--next" rel="next">
            <div class="md-flex__cell md-flex__cell--stretch md-footer-nav__title">
              <span class="md-flex__ellipsis">
                <span class="md-footer-nav__direction">
                  前进
                </span>
                Contribute to Nebula
              </span>
            </div>
            <div class="md-flex__cell md-flex__cell--shrink">
              <i class="md-icon md-icon--arrow-forward md-footer-nav__button"></i>
            </div>
          </a>
        
      </nav>
    </div>
  
  <div class="md-footer-meta md-typeset">
    <div class="md-footer-meta__inner md-grid">
      <div class="md-footer-copyright">
        
          <div class="md-footer-copyright__highlight">
            Copyright &copy; 2018 - 2019 Nebula Graph
          </div>
        
        powered by
        <a href="https://www.mkdocs.org">MkDocs</a>
        and
        <a href="https://squidfunk.github.io/mkdocs-material/">
          Material for MkDocs</a>
      </div>
      
  <div class="md-footer-social">
    <link rel="stylesheet" href="../../assets/fonts/font-awesome.css">
    
      <a href="https://github.com/vesoft-inc/nebula" class="md-footer-social__link fa fa-github"></a>
    
      <a href="https://www.weibo.com/u/7122684542?is_hot=1" class="md-footer-social__link fa fa-weibo"></a>
    
  </div>

    </div>
  </div>
</footer>
      
    </div>
    
      <script src="../../assets/javascripts/application.39abc4af.js"></script>
      
        
        
          
          <script src="../../assets/javascripts/lunr/lunr.stemmer.support.js"></script>
          
            
              
                <script src="../../assets/javascripts/lunr/tinyseg.js"></script>
              
              
                <script src="../../assets/javascripts/lunr/lunr.ja.js"></script>
              
            
          
          
        
      
      <script>app.initialize({version:"1.0.4",url:{base:"../.."}})</script>
      
    
  </body>
</html>