



<!doctype html>
<html lang="en" class="no-js">
  <head>
    
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width,initial-scale=1">
      <meta http-equiv="x-ua-compatible" content="ie=edge">
      
        <meta name="description" content="Documentation for Nebula Graph">
      
      
        <link rel="canonical" href="http://docs.nebula-graph.io/get-started/">
      
      
        <meta name="author" content="Nebula">
      
      
        <meta name="lang:clipboard.copy" content="Copy to clipboard">
      
        <meta name="lang:clipboard.copied" content="Copied to clipboard">
      
        <meta name="lang:search.language" content="en">
      
        <meta name="lang:search.pipeline.stopwords" content="True">
      
        <meta name="lang:search.pipeline.trimmer" content="True">
      
        <meta name="lang:search.result.none" content="No matching documents">
      
        <meta name="lang:search.result.one" content="1 matching document">
      
        <meta name="lang:search.result.other" content="# matching documents">
      
        <meta name="lang:search.tokenizer" content="[\s\-]+">
      
      <link rel="shortcut icon" href="../images/favicon.ico">
      <meta name="generator" content="mkdocs-1.0.4, mkdocs-material-4.2.0">
    
    
      
        <title>Quickstart - Nebula Graph Docs</title>
      
    
    
      <link rel="stylesheet" href="../assets/stylesheets/application.750b69bd.css">
      
        <link rel="stylesheet" href="../assets/stylesheets/application-palette.224b79ff.css">
      
      
        
        
        <meta name="theme-color" content="#3f51b5">
      
    
    
      <script src="../assets/javascripts/modernizr.74668098.js"></script>
    
    
      
        <link href="https://fonts.gstatic.com" rel="preconnect" crossorigin>
        <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto:300,400,400i,700|Roboto+Mono">
        <style>body,input{font-family:"Roboto","Helvetica Neue",Helvetica,Arial,sans-serif}code,kbd,pre{font-family:"Roboto Mono","Courier New",Courier,monospace}</style>
      
    
    <link rel="stylesheet" href="../assets/fonts/material-icons.css">
    
    
      <link rel="stylesheet" href="../stylesheets/extra.css">
    
    
      
    
    
  </head>
  
    
    
    <body dir="ltr" data-md-color-primary="indigo" data-md-color-accent="indigo">
  
    <svg class="md-svg">
      <defs>
        
        
          <svg xmlns="http://www.w3.org/2000/svg" width="416" height="448"
    viewBox="0 0 416 448" id="__github">
  <path fill="currentColor" d="M160 304q0 10-3.125 20.5t-10.75 19-18.125
        8.5-18.125-8.5-10.75-19-3.125-20.5 3.125-20.5 10.75-19 18.125-8.5
        18.125 8.5 10.75 19 3.125 20.5zM320 304q0 10-3.125 20.5t-10.75
        19-18.125 8.5-18.125-8.5-10.75-19-3.125-20.5 3.125-20.5 10.75-19
        18.125-8.5 18.125 8.5 10.75 19 3.125 20.5zM360
        304q0-30-17.25-51t-46.75-21q-10.25 0-48.75 5.25-17.75 2.75-39.25
        2.75t-39.25-2.75q-38-5.25-48.75-5.25-29.5 0-46.75 21t-17.25 51q0 22 8
        38.375t20.25 25.75 30.5 15 35 7.375 37.25 1.75h42q20.5 0
        37.25-1.75t35-7.375 30.5-15 20.25-25.75 8-38.375zM416 260q0 51.75-15.25
        82.75-9.5 19.25-26.375 33.25t-35.25 21.5-42.5 11.875-42.875 5.5-41.75
        1.125q-19.5 0-35.5-0.75t-36.875-3.125-38.125-7.5-34.25-12.875-30.25-20.25-21.5-28.75q-15.5-30.75-15.5-82.75
        0-59.25 34-99-6.75-20.5-6.75-42.5 0-29 12.75-54.5 27 0 47.5 9.875t47.25
        30.875q36.75-8.75 77.25-8.75 37 0 70 8 26.25-20.5
        46.75-30.25t47.25-9.75q12.75 25.5 12.75 54.5 0 21.75-6.75 42 34 40 34
        99.5z" />
</svg>
        
      </defs>
    </svg>
    <input class="md-toggle" data-md-toggle="drawer" type="checkbox" id="__drawer" autocomplete="off">
    <input class="md-toggle" data-md-toggle="search" type="checkbox" id="__search" autocomplete="off">
    <label class="md-overlay" data-md-component="overlay" for="__drawer"></label>
    
      <a href="#install-nebula-graph" tabindex="1" class="md-skip">
        Skip to content
      </a>
    
    
      <header class="md-header" data-md-component="header">
  <nav class="md-header-nav md-grid">
    <div class="md-flex">
      <div class="md-flex__cell md-flex__cell--shrink">
        <a href="http://docs.nebula-graph.io/" title="Nebula Graph Docs" class="md-header-nav__button md-logo">
          
            <i class="md-icon">library_books</i>
          
        </a>
      </div>
      <div class="md-flex__cell md-flex__cell--shrink">
        <label class="md-icon md-icon--menu md-header-nav__button" for="__drawer"></label>
      </div>
      <div class="md-flex__cell md-flex__cell--stretch">
        <div class="md-flex__ellipsis md-header-nav__title" data-md-component="title">
          
            <span class="md-header-nav__topic">
              Nebula Graph Docs
            </span>
            <span class="md-header-nav__topic">
              Quickstart
            </span>
          
        </div>
      </div>
      <div class="md-flex__cell md-flex__cell--shrink">
        
          <label class="md-icon md-icon--search md-header-nav__button" for="__search"></label>
          
<div class="md-search" data-md-component="search" role="dialog">
  <label class="md-search__overlay" for="__search"></label>
  <div class="md-search__inner" role="search">
    <form class="md-search__form" name="search">
      <input type="text" class="md-search__input" name="query" placeholder="Search" autocapitalize="off" autocorrect="off" autocomplete="off" spellcheck="false" data-md-component="query" data-md-state="active">
      <label class="md-icon md-search__icon" for="__search"></label>
      <button type="reset" class="md-icon md-search__icon" data-md-component="reset" tabindex="-1">
        &#xE5CD;
      </button>
    </form>
    <div class="md-search__output">
      <div class="md-search__scrollwrap" data-md-scrollfix>
        <div class="md-search-result" data-md-component="result">
          <div class="md-search-result__meta">
            Type to start searching
          </div>
          <ol class="md-search-result__list"></ol>
        </div>
      </div>
    </div>
  </div>
</div>
        
      </div>
      
        <div class="md-flex__cell md-flex__cell--shrink">
          <div class="md-header-nav__source">
            


  

<a href="https://github.com/vesoft-inc/nebula/" title="Go to repository" class="md-source" data-md-source="github">
  
    <div class="md-source__icon">
      <svg viewBox="0 0 24 24" width="24" height="24">
        <use xlink:href="#__github" width="24" height="24"></use>
      </svg>
    </div>
  
  <div class="md-source__repository">
    vesoft-inc/nebula
  </div>
</a>
          </div>
        </div>
      
    </div>
  </nav>
</header>
    
    <div class="md-container">
      
        
      
      
        

<nav class="md-tabs" data-md-component="tabs">
  <div class="md-tabs__inner md-grid">
    <ul class="md-tabs__list">
      
        
  <li class="md-tabs__item">
    
      <a href=".." title="Overview" class="md-tabs__link md-tabs__link--active">
        Overview
      </a>
    
  </li>

      
        
      
        
  
  
    <li class="md-tabs__item">
      
        <a href="../nGQL-tutorial/" title="Nebula Reference Manual" class="md-tabs__link">
          Nebula Reference Manual
        </a>
      
    </li>
  

      
    </ul>
  </div>
</nav>
      
      <main class="md-main">
        <div class="md-main__inner md-grid" data-md-component="container">
          
            
              <div class="md-sidebar md-sidebar--primary" data-md-component="navigation">
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    <nav class="md-nav md-nav--primary" data-md-level="0">
  <label class="md-nav__title md-nav__title--site" for="__drawer">
    <a href="http://docs.nebula-graph.io/" title="Nebula Graph Docs" class="md-nav__button md-logo">
      
        <i class="md-icon">library_books</i>
      
    </a>
    Nebula Graph Docs
  </label>
  
    <div class="md-nav__source">
      


  

<a href="https://github.com/vesoft-inc/nebula/" title="Go to repository" class="md-source" data-md-source="github">
  
    <div class="md-source__icon">
      <svg viewBox="0 0 24 24" width="24" height="24">
        <use xlink:href="#__github" width="24" height="24"></use>
      </svg>
    </div>
  
  <div class="md-source__repository">
    vesoft-inc/nebula
  </div>
</a>
    </div>
  
  <ul class="md-nav__list" data-md-scrollfix>
    
      
      
      


  <li class="md-nav__item">
    <a href=".." title="Overview" class="md-nav__link">
      Overview
    </a>
  </li>

    
      
      
      

  


  <li class="md-nav__item md-nav__item--active">
    
    <input class="md-toggle md-nav__toggle" data-md-toggle="toc" type="checkbox" id="__toc">
    
    
      <label class="md-nav__link md-nav__link--active" for="__toc">
        Quickstart
      </label>
    
    <a href="./" title="Quickstart" class="md-nav__link md-nav__link--active">
      Quickstart
    </a>
    
      
<nav class="md-nav md-nav--secondary">
  
  
  
    <label class="md-nav__title" for="__toc">Table of contents</label>
    <ul class="md-nav__list" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#install-nebula-graph" title="Install Nebula Graph" class="md-nav__link">
    Install Nebula Graph
  </a>
  
    <nav class="md-nav">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#from-docker" title="From Docker" class="md-nav__link">
    From Docker
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#from-sourcelinux" title="From Source(Linux)" class="md-nav__link">
    From Source(Linux)
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#build-your-own-graph" title="Build Your Own Graph" class="md-nav__link">
    Build Your Own Graph
  </a>
  
    <nav class="md-nav">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#create-a-graph-space" title="Create a Graph Space" class="md-nav__link">
    Create a Graph Space
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#define-graph-schema" title="Define Graph Schema" class="md-nav__link">
    Define Graph Schema
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#insert-data" title="Insert Data" class="md-nav__link">
    Insert Data
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#sample-queries" title="Sample Queries" class="md-nav__link">
    Sample Queries
  </a>
  
</li>
      
      
      
      
      
    </ul>
  
</nav>
    
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3" type="checkbox" id="nav-3">
    
    <label class="md-nav__link" for="nav-3">
      Nebula Reference Manual
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-3">
        Nebula Reference Manual
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../nGQL-tutorial/" title="nGQL Query Language" class="md-nav__link">
      nGQL Query Language
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../how-to-contribute/" title="Contribute to Nebula" class="md-nav__link">
      Contribute to Nebula
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../developer-documentation-style-guide/" title="Developer documentation style guide" class="md-nav__link">
      Developer documentation style guide
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../contribute-to-documentation/" title="Contribute to docs" class="md-nav__link">
      Contribute to docs
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

    
  </ul>
</nav>
                  </div>
                </div>
              </div>
            
            
              <div class="md-sidebar md-sidebar--secondary" data-md-component="toc">
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    
<nav class="md-nav md-nav--secondary">
  
  
  
    <label class="md-nav__title" for="__toc">Table of contents</label>
    <ul class="md-nav__list" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#install-nebula-graph" title="Install Nebula Graph" class="md-nav__link">
    Install Nebula Graph
  </a>
  
    <nav class="md-nav">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#from-docker" title="From Docker" class="md-nav__link">
    From Docker
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#from-sourcelinux" title="From Source(Linux)" class="md-nav__link">
    From Source(Linux)
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#build-your-own-graph" title="Build Your Own Graph" class="md-nav__link">
    Build Your Own Graph
  </a>
  
    <nav class="md-nav">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#create-a-graph-space" title="Create a Graph Space" class="md-nav__link">
    Create a Graph Space
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#define-graph-schema" title="Define Graph Schema" class="md-nav__link">
    Define Graph Schema
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#insert-data" title="Insert Data" class="md-nav__link">
    Insert Data
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#sample-queries" title="Sample Queries" class="md-nav__link">
    Sample Queries
  </a>
  
</li>
      
      
      
      
      
    </ul>
  
</nav>
                  </div>
                </div>
              </div>
            
          
          <div class="md-content">
            <article class="md-content__inner md-typeset">
              
                
                  <a href="https://github.com/vesoft-inc/nebula/edit/master/docs/get-started.md" title="Edit this page" class="md-icon md-content__icon">&#xE3C9;</a>
                
                
                  <h1>Quickstart</h1>
                
                <hr />
<p>This tutorial provides a quick introduction to use <code>Nebula Graph</code>.</p>
<hr />
<h2 id="install-nebula-graph">Install Nebula Graph<a class="headerlink" href="#install-nebula-graph" title="Permanent link">&para;</a></h2>
<h3 id="from-docker">From Docker<a class="headerlink" href="#from-docker" title="Permanent link">&para;</a></h3>
<p>The easiest way to startup <code>nebula</code> is using <code>docker</code>.</p>
<p>First of all, you should make sure that <code>docker</code> has been installed on your machine. Open a terminal and run the following command :</p>
<div class="codehilite"><pre><span></span>&gt; docker --version
Docker version 18.09.2, build 6247962
</pre></div>


<p>If <code>docker</code> is not found, please see <a href="https://docs.docker.com/install/">here</a> for more information to install docker.</p>
<p>After that, using</p>
<div class="codehilite"><pre><span></span>&gt; docker pull vesoft/nebula-graph:latest
ac9208207ada: Pulling fs layer
cdcb67189ff7: Pulling fs layer
80407c3cb6b4: Pulling fs layer
latest: Pulling from vesoft/nebula-graph
ac9208207ada: Pull complete
cdcb67189ff7: Pull complete
80407c3cb6b4: Pull complete
Digest: sha256:72a73c801685595776779291969b57ab758f53ebd9bda8bab56421e50bfee161
Status: Downloaded newer image for vesoft/nebula-graph:latest
</pre></div>


<p>to get <code>nebula</code> docker images.</p>
<p>Then type command <code>docker images</code> to check the image status.</p>
<div class="codehilite"><pre><span></span>&gt; docker images
REPOSITORY            TAG                 IMAGE ID            CREATED             SIZE
vesoft/nebula-graph   latest              1afd60e223ca        4 weeks ago         401MB
</pre></div>


<!-- If `docker` is slow when pulling the image, configure a new mirror.

You can add the source at `/etc/docker/daemon.json`, for Linux users:


<div class="codehilite"><pre><span></span>{
  &quot;registry-mirrors&quot;: [
    &quot;https://dockerhub.azk8s.cn&quot;,
    &quot;https://reg-mirror.qiniu.com&quot;
  ]
}
</pre></div>



For macOS users, click the Docker Desktop icon -> Preferences -> Daemon -> Registry mirrors. Add https://dockerhub.azk8s.cn and https://reg-mirror.qiniu.com to the list. Once the modification is complete, click the Apply & Restart button to restart Docker. -->

<hr />
<p><strong>Startup Nebula Graph</strong></p>
<p>When <code>nebula</code> image is ready, run</p>
<div class="codehilite"><pre><span></span>&gt; docker run -it vesoft/nebula-graph:latest /bin/bash
</pre></div>


<p>to start and login to the docker container.
After login, you're in the <code>root</code> directory and you should use <code>cd ~/nebula-graph/</code> to switch to the nebula home directory.</p>
<p>Run</p>
<div class="codehilite"><pre><span></span>&gt; ./start-all.sh
Starting MetaService StorageService and GraphService ...
</pre></div>


<p>to start meta service, storage service and graph service.</p>
<p>Run</p>
<div class="codehilite"><pre><span></span>&gt; ps -ef | grep nebula
</pre></div>


<p>to display the services' running status.</p>
<p>Please make sure the services are working.</p>
<!-- `bin/nebula` is a `console` which can be used to insert and query data.

`--port` is used for specifying the graph server port and the default value is `3699`.

`-u` and `-p` are used to specify the user name and password, `user` and `password` are the default authority.

Run


<div class="codehilite"><pre><span></span> &gt; bin/nebula --port=3699 -u=user -p=password
</pre></div>



to connect to the graph server. -->

<p>To connect to the graph server, run</p>
<div class="codehilite"><pre><span></span>&gt; ./start-console.sh

Welcome to Nebula Graph (Version 0.1)

nebula&gt;
</pre></div>


<p>If you have any questions or concerns about the deployment procedures, please do not hesitate to open an issue on <a href="https://github.com/vesoft-inc/nebula/issues">GitHub</a>.</p>
<h3 id="from-sourcelinux">From Source(Linux)<a class="headerlink" href="#from-sourcelinux" title="Permanent link">&para;</a></h3>
<p><strong>Prerequisite Tools</strong></p>
<p>Nebula Graph is written in C++14, so it requires a complier supporting C++14 features.</p>
<p>3rd-party Libraries</p>
<ul>
<li>autoconf</li>
<li>automake</li>
<li>libtool</li>
<li>cmake</li>
<li>bison</li>
<li>unzip</li>
<li>boost</li>
<li>gperf</li>
<li>krb5</li>
<li>openssl</li>
<li>libunwind</li>
<li>ncurses</li>
<li>readline</li>
</ul>
<p>It is recommended to install g++ 5 or higher Linux system, such as Fedora 29.
Currently, we are using <code>git-lfs</code> to store the 3rd-party libraries so make sure
<code>git-lfs</code> have been installed before fetching the source code.</p>
<p><strong>Fetch from GitHub</strong></p>
<div class="codehilite"><pre><span></span>&gt; git clone https://github.com/vesoft-inc/nebula.git
</pre></div>


<p><strong>Compiling</strong></p>
<div class="codehilite"><pre><span></span>&gt; cmake ./
</pre></div>


<p>The default installation is in /usr/local path. To specify the installation path,
use:</p>
<div class="codehilite"><pre><span></span>&gt; cmake -DCMAKE_INSTALL_PREFIX=$your_nebula_install_dir
</pre></div>


<p>to replace the <code>$your_nebula_install_dir</code> here</p>
<p>Then run the following command:</p>
<div class="codehilite"><pre><span></span>&gt; make &amp;&amp; make install
</pre></div>


<p><strong>Running</strong></p>
<p>Configure nebula-metad.conf</p>
<p>In your Nebula installation directory, run</p>
<div class="codehilite"><pre><span></span>&gt; cp etc/nebula-metad.conf.default etc/nebula-metad.conf
</pre></div>


<p>Modify configurations in nebula-metad.conf:</p>
<ul>
<li>local_ip</li>
<li>port</li>
<li>ws_http_port metaservice HTTP</li>
<li>ws_h2_port metaservice HTTP2</li>
</ul>
<p>Configure nebula-storaged.conf</p>
<div class="codehilite"><pre><span></span>&gt; cp etc/nebula-storaged.conf.default etc/nebula-storaged.conf
</pre></div>


<p>Modify configurations in nebula-storaged.conf:</p>
<ul>
<li>local_ip</li>
<li>port</li>
<li>ws_http_port storageservice HTTP</li>
<li>ws_h2_port storageservice HTTP2</li>
</ul>
<p>Configure nebula-graphd.conf</p>
<div class="codehilite"><pre><span></span>&gt; cp etc/nebula-graphd.conf.default etc/nebula-graphd.conf
</pre></div>


<p>Modify configurations in nebula-graphd.conf:</p>
<ul>
<li>local_ip</li>
<li>port</li>
<li>ws_http_port graphservice HTTP</li>
<li>ws_h2_port graphservice HTTP2</li>
</ul>
<p><strong>Start service</strong></p>
<div class="codehilite"><pre><span></span>&gt; scripts/nebula.service start all
</pre></div>


<p>Make sure all the services are working</p>
<div class="codehilite"><pre><span></span>&gt; scripts/nebula.service status all
</pre></div>


<p><strong>Connect to Nebula</strong></p>
<div class="codehilite"><pre><span></span>&gt; bin/nebula -u=user -p=password
</pre></div>


<ul>
<li>-u is to set user name, <code>user</code> is the default Nebula user account</li>
<li>-p is to set password, <code>password</code> is the default password for account <code>user</code></li>
</ul>
<p>Add host to make console connect to the Nebula service:</p>
<div class="codehilite"><pre><span></span>&gt; ADD HOSTS $storage_ip:$storage_port
</pre></div>


<p>Replace the <code>$storage_ip</code> and <code>$storage_port</code> here according to the <code>local_ip</code>
and <code>port</code> in nebula-storaged.conf</p>
<p>Then you’re now ready to start using Nebula Graph.</p>
<hr />
<h2 id="build-your-own-graph">Build Your Own Graph<a class="headerlink" href="#build-your-own-graph" title="Permanent link">&para;</a></h2>
<p>This section describes how to build a graph and run queries. The example is built on the graph below:</p>
<p><img alt="Untitled Diagram (1)" src="https://user-images.githubusercontent.com/51590253/60649144-0774c980-9e74-11e9-86d6-bad1653e70ba.png" /></p>
<p>There are three kinds of tags (<em>course</em>, <em>building</em> and <em>team</em>) and two edge types (<em>select</em> and <em>like</em>). The graph schema is:</p>
<div class="codehilite"><pre><span></span><span class="p">{</span>  
   <span class="nt">&quot;tags&quot;</span><span class="p">:{</span>  
      <span class="nt">&quot;course&quot;</span><span class="p">:[</span>  
         <span class="s2">&quot;name: string&quot;</span><span class="p">,</span>
         <span class="s2">&quot;credits: integer&quot;</span>
      <span class="p">],</span>
      <span class="nt">&quot;building&quot;</span><span class="p">:[</span>  
         <span class="s2">&quot;name: string&quot;</span>
      <span class="p">],</span>
      <span class="nt">&quot;student&quot;</span><span class="p">:[</span>  
         <span class="s2">&quot;name: string&quot;</span><span class="p">,</span>
         <span class="s2">&quot;age: integer&quot;</span><span class="p">,</span>
         <span class="s2">&quot;gender: string&quot;</span>
      <span class="p">]</span>
   <span class="p">},</span>
   <span class="nt">&quot;edges&quot;</span><span class="p">:{</span>  
      <span class="nt">&quot;select&quot;</span><span class="p">:[</span>  
         <span class="s2">&quot;grade: integer&quot;</span>
      <span class="p">],</span>
      <span class="nt">&quot;like&quot;</span><span class="p">:[</span>  
         <span class="s2">&quot;likeness: double&quot;</span>
      <span class="p">]</span>
   <span class="p">}</span>
<span class="p">}</span>
</pre></div>


<h3 id="create-a-graph-space">Create a Graph Space<a class="headerlink" href="#create-a-graph-space" title="Permanent link">&para;</a></h3>
<p><strong>SPACE</strong> is a region that provides physically isolation of graphs in Nebula. First we need to create a space and use it before other operations.</p>
<p>To list all existing spaces:</p>
<div class="codehilite"><pre><span></span>nebula&gt; SHOW SPACES;
</pre></div>


<p>To create a new space named myspace_test2 :</p>
<div class="codehilite"><pre><span></span>nebula&gt; CREATE SPACE myspace_test2(partition_num=1, replica_factor=1);

-- Use this space
nebula&gt; USE myspace_test2;
</pre></div>


<p><code>replica_factor</code> specifies the number of replicas in the cluster.</p>
<p><code>partition_num</code> specifies the number of partitions in one replica.</p>
<h3 id="define-graph-schema">Define Graph Schema<a class="headerlink" href="#define-graph-schema" title="Permanent link">&para;</a></h3>
<p>The <code>CREATE TAG</code> statement defines a tag, with a type name and an attribute list.</p>
<div class="codehilite"><pre><span></span>nebula&gt; CREATE TAG course(name string, credits int);
nebula&gt; CREATE TAG building(name string);
nebula&gt; CREATE TAG student(name string, age int, gender string);
</pre></div>


<p>The <code>CREATE EDGE</code> statement defines an edge type.</p>
<div class="codehilite"><pre><span></span>nebula&gt; CREATE EDGE like(likeness double);
nebula&gt; CREATE EDGE select(grade int);
</pre></div>


<p>To list the tags and edge types that we just created：</p>
<div class="codehilite"><pre><span></span>-- Show tag list
nebula&gt; SHOW TAGS;

-- Show edge type list
nebula&gt; SHOW EDGES;
</pre></div>


<p>To show the attributes of a tag or an edge type:</p>
<div class="codehilite"><pre><span></span>-- Show attributes of a tag
nebula&gt; DESCRIBE TAG student;

-- Show attributes of an edge type
nebula&gt; DESCRIBE EDGE like;
</pre></div>


<h3 id="insert-data">Insert Data<a class="headerlink" href="#insert-data" title="Permanent link">&para;</a></h3>
<p>Insert the vertices and edges based on the graph above.</p>
<div class="codehilite"><pre><span></span>-- Insert vertices
nebula&gt; INSERT VERTEX student(name, age, gender) VALUES 200:(&quot;Monica&quot;, 16, &quot;female&quot;);
nebula&gt; INSERT VERTEX student(name, age, gender) VALUES 201:(&quot;Mike&quot;, 18, &quot;male&quot;);
nebula&gt; INSERT VERTEX student(name, age, gender) VALUES 202:(&quot;Jane&quot;, 17, &quot;female&quot;);
nebula&gt; INSERT VERTEX course(name, credits),building(name) VALUES 101:(&quot;Math&quot;, 3, &quot;No5&quot;);
nebula&gt; INSERT VERTEX course(name, credits),building(name) VALUES 102:(&quot;English&quot;, 6, &quot;No11&quot;);
</pre></div>


<div class="codehilite"><pre><span></span>-- Insert edges
nebula&gt; INSERT EDGE select(grade) VALUES 200 -&gt; 101:(5);
nebula&gt; INSERT EDGE select(grade) VALUES 200 -&gt; 102:(3);
nebula&gt; INSERT EDGE select(grade) VALUES 201 -&gt; 102:(3);
nebula&gt; INSERT EDGE select(grade) VALUES 202 -&gt; 102:(3);
nebula&gt; INSERT EDGE like(likeness) VALUES 200 -&gt; 201:(92.5);
nebula&gt; INSERT EDGE like(likeness) VALUES 201 -&gt; 200:(85.6);
nebula&gt; INSERT EDGE like(likeness) VALUES 201 -&gt; 202:(93.2);
</pre></div>


<h2 id="sample-queries">Sample Queries<a class="headerlink" href="#sample-queries" title="Permanent link">&para;</a></h2>
<p>Q1. Find the vertexes that 201 likes:</p>
<div class="codehilite"><pre><span></span>nebula&gt; GO FROM 201 OVER like;

=======
|  id |
=======
| 200 |
-------
| 202 |
-------
</pre></div>


<p>Q2. Find the vertexes that 201 likes, whose age are greater than 17. Return their name, age and gender, and alias the columns as Friend, Age and Gender, respectively.</p>
<div class="codehilite"><pre><span></span>nebula&gt; GO FROM 201 OVER like WHERE $$.student.age &gt;= 17 YIELD $$.student.name AS Friend, $$.student.age AS Age, $$.student.gender AS Gender;

=========================
| Friend | Age | Gender |
=========================
|   Jane |  17 | female |
-------------------------
</pre></div>


<p><code>YIELD</code> specifies what values or results you might want to return from query.</p>
<p><code>$^</code> represents the source vertex.</p>
<p><code>$$</code> indicates the target vertex.</p>
<p>Q3. Find the courses that the vertices liked by 201 select and their grade.</p>
<div class="codehilite"><pre><span></span>-- By pipe
nebula&gt; GO FROM 201 OVER like | GO FROM $-.id OVER select YIELD $^.student.name AS Student, $$.course.name AS Course, select.grade AS Grade;

=============================
| Student |  Course | Grade |
=============================
|  Monica |    Math |     5 |
-----------------------------
|  Monica | English |     3 |
-----------------------------
|    Jane | English |     3 |
-----------------------------

-- By temporary variable
nebula&gt; $a=GO FROM 201 OVER like; GO FROM $a.id OVER select YIELD $^.student.name AS Student, $$.course.name AS Course, select.grade AS Grade;

=============================
| Student |  Course | Grade |
=============================
|  Monica |    Math |     5 |
-----------------------------
|  Monica | English |     3 |
-----------------------------
|    Jane | English |     3 |
-----------------------------
</pre></div>


<p><code>|</code> denotes a pipe. The output of the formal query acts as input to the next one like a pipeline.</p>
<p><code>$-</code> refers to the input stream.</p>
<p>The second approach adopts a user-defined variable <code>$a</code>. The scope of this variable is within the compound statement.</p>
<p>For more details about Query Language, check <a href="../nGQL-tutorial/">nGQL Query Language</a>.</p>
                
                  
                
              
              
                


              
            </article>
          </div>
        </div>
      </main>
      
        
<footer class="md-footer">
  
    <div class="md-footer-nav">
      <nav class="md-footer-nav__inner md-grid">
        
          <a href=".." title="Overview" class="md-flex md-footer-nav__link md-footer-nav__link--prev" rel="prev">
            <div class="md-flex__cell md-flex__cell--shrink">
              <i class="md-icon md-icon--arrow-back md-footer-nav__button"></i>
            </div>
            <div class="md-flex__cell md-flex__cell--stretch md-footer-nav__title">
              <span class="md-flex__ellipsis">
                <span class="md-footer-nav__direction">
                  Previous
                </span>
                Overview
              </span>
            </div>
          </a>
        
        
          <a href="../nGQL-tutorial/" title="nGQL Query Language" class="md-flex md-footer-nav__link md-footer-nav__link--next" rel="next">
            <div class="md-flex__cell md-flex__cell--stretch md-footer-nav__title">
              <span class="md-flex__ellipsis">
                <span class="md-footer-nav__direction">
                  Next
                </span>
                nGQL Query Language
              </span>
            </div>
            <div class="md-flex__cell md-flex__cell--shrink">
              <i class="md-icon md-icon--arrow-forward md-footer-nav__button"></i>
            </div>
          </a>
        
      </nav>
    </div>
  
  <div class="md-footer-meta md-typeset">
    <div class="md-footer-meta__inner md-grid">
      <div class="md-footer-copyright">
        
          <div class="md-footer-copyright__highlight">
            Copyright &copy; 2018 - 2019 Nebula Graph
          </div>
        
        powered by
        <a href="https://www.mkdocs.org">MkDocs</a>
        and
        <a href="https://squidfunk.github.io/mkdocs-material/">
          Material for MkDocs</a>
      </div>
      
  <div class="md-footer-social">
    <link rel="stylesheet" href="../assets/fonts/font-awesome.css">
    
      <a href="https://github.com/vesoft-inc/nebula" class="md-footer-social__link fa fa-github"></a>
    
      <a href="https://www.weibo.com/u/7122684542?is_hot=1" class="md-footer-social__link fa fa-weibo"></a>
    
  </div>

    </div>
  </div>
</footer>
      
    </div>
    
      <script src="../assets/javascripts/application.39abc4af.js"></script>
      
      <script>app.initialize({version:"1.0.4",url:{base:".."}})</script>
      
    
  </body>
</html>