



<!doctype html>
<html lang="en" class="no-js">
  <head>
    
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width,initial-scale=1">
      <meta http-equiv="x-ua-compatible" content="ie=edge">
      
        <meta name="description" content="Documentation for Nebula Graph">
      
      
        <link rel="canonical" href="https://vesoft-inc.github.io/nebula/get-started/">
      
      
        <meta name="author" content="Nebula">
      
      
        <meta name="lang:clipboard.copy" content="Copy to clipboard">
      
        <meta name="lang:clipboard.copied" content="Copied to clipboard">
      
        <meta name="lang:search.language" content="en">
      
        <meta name="lang:search.pipeline.stopwords" content="True">
      
        <meta name="lang:search.pipeline.trimmer" content="True">
      
        <meta name="lang:search.result.none" content="No matching documents">
      
        <meta name="lang:search.result.one" content="1 matching document">
      
        <meta name="lang:search.result.other" content="# matching documents">
      
        <meta name="lang:search.tokenizer" content="[\s\-]+">
      
      <link rel="shortcut icon" href="../images/favicon.ico">
      <meta name="generator" content="mkdocs-1.0.4, mkdocs-material-4.2.0">
    
    
      
        <title>Quickstart - Nebula Graph Docs</title>
      
    
    
      <link rel="stylesheet" href="../assets/stylesheets/application.750b69bd.css">
      
        <link rel="stylesheet" href="../assets/stylesheets/application-palette.224b79ff.css">
      
      
        
        
        <meta name="theme-color" content="#3f51b5">
      
    
    
      <script src="../assets/javascripts/modernizr.74668098.js"></script>
    
    
      
        <link href="https://fonts.gstatic.com" rel="preconnect" crossorigin>
        <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto:300,400,400i,700|Roboto+Mono">
        <style>body,input{font-family:"Roboto","Helvetica Neue",Helvetica,Arial,sans-serif}code,kbd,pre{font-family:"Roboto Mono","Courier New",Courier,monospace}</style>
      
    
    <link rel="stylesheet" href="../assets/fonts/material-icons.css">
    
    
    
      
    
    
  </head>
  
    
    
    <body dir="ltr" data-md-color-primary="indigo" data-md-color-accent="indigo">
  
    <svg class="md-svg">
      <defs>
        
        
          <svg xmlns="http://www.w3.org/2000/svg" width="416" height="448"
    viewBox="0 0 416 448" id="__github">
  <path fill="currentColor" d="M160 304q0 10-3.125 20.5t-10.75 19-18.125
        8.5-18.125-8.5-10.75-19-3.125-20.5 3.125-20.5 10.75-19 18.125-8.5
        18.125 8.5 10.75 19 3.125 20.5zM320 304q0 10-3.125 20.5t-10.75
        19-18.125 8.5-18.125-8.5-10.75-19-3.125-20.5 3.125-20.5 10.75-19
        18.125-8.5 18.125 8.5 10.75 19 3.125 20.5zM360
        304q0-30-17.25-51t-46.75-21q-10.25 0-48.75 5.25-17.75 2.75-39.25
        2.75t-39.25-2.75q-38-5.25-48.75-5.25-29.5 0-46.75 21t-17.25 51q0 22 8
        38.375t20.25 25.75 30.5 15 35 7.375 37.25 1.75h42q20.5 0
        37.25-1.75t35-7.375 30.5-15 20.25-25.75 8-38.375zM416 260q0 51.75-15.25
        82.75-9.5 19.25-26.375 33.25t-35.25 21.5-42.5 11.875-42.875 5.5-41.75
        1.125q-19.5 0-35.5-0.75t-36.875-3.125-38.125-7.5-34.25-12.875-30.25-20.25-21.5-28.75q-15.5-30.75-15.5-82.75
        0-59.25 34-99-6.75-20.5-6.75-42.5 0-29 12.75-54.5 27 0 47.5 9.875t47.25
        30.875q36.75-8.75 77.25-8.75 37 0 70 8 26.25-20.5
        46.75-30.25t47.25-9.75q12.75 25.5 12.75 54.5 0 21.75-6.75 42 34 40 34
        99.5z" />
</svg>
        
      </defs>
    </svg>
    <input class="md-toggle" data-md-toggle="drawer" type="checkbox" id="__drawer" autocomplete="off">
    <input class="md-toggle" data-md-toggle="search" type="checkbox" id="__search" autocomplete="off">
    <label class="md-overlay" data-md-component="overlay" for="__drawer"></label>
    
      <a href="#step-1-install-nebula-graph" tabindex="1" class="md-skip">
        Skip to content
      </a>
    
    
      <header class="md-header" data-md-component="header">
  <nav class="md-header-nav md-grid">
    <div class="md-flex">
      <div class="md-flex__cell md-flex__cell--shrink">
        <a href="https://vesoft-inc.github.io/nebula/" title="Nebula Graph Docs" class="md-header-nav__button md-logo">
          
            <i class="md-icon">library_books</i>
          
        </a>
      </div>
      <div class="md-flex__cell md-flex__cell--shrink">
        <label class="md-icon md-icon--menu md-header-nav__button" for="__drawer"></label>
      </div>
      <div class="md-flex__cell md-flex__cell--stretch">
        <div class="md-flex__ellipsis md-header-nav__title" data-md-component="title">
          
            <span class="md-header-nav__topic">
              Nebula Graph Docs
            </span>
            <span class="md-header-nav__topic">
              Quickstart
            </span>
          
        </div>
      </div>
      <div class="md-flex__cell md-flex__cell--shrink">
        
          <label class="md-icon md-icon--search md-header-nav__button" for="__search"></label>
          
<div class="md-search" data-md-component="search" role="dialog">
  <label class="md-search__overlay" for="__search"></label>
  <div class="md-search__inner" role="search">
    <form class="md-search__form" name="search">
      <input type="text" class="md-search__input" name="query" placeholder="Search" autocapitalize="off" autocorrect="off" autocomplete="off" spellcheck="false" data-md-component="query" data-md-state="active">
      <label class="md-icon md-search__icon" for="__search"></label>
      <button type="reset" class="md-icon md-search__icon" data-md-component="reset" tabindex="-1">
        &#xE5CD;
      </button>
    </form>
    <div class="md-search__output">
      <div class="md-search__scrollwrap" data-md-scrollfix>
        <div class="md-search-result" data-md-component="result">
          <div class="md-search-result__meta">
            Type to start searching
          </div>
          <ol class="md-search-result__list"></ol>
        </div>
      </div>
    </div>
  </div>
</div>
        
      </div>
      
        <div class="md-flex__cell md-flex__cell--shrink">
          <div class="md-header-nav__source">
            


  

<a href="https://github.com/vesoft-inc/nebula/" title="Go to repository" class="md-source" data-md-source="github">
  
    <div class="md-source__icon">
      <svg viewBox="0 0 24 24" width="24" height="24">
        <use xlink:href="#__github" width="24" height="24"></use>
      </svg>
    </div>
  
  <div class="md-source__repository">
    vesoft-inc/nebula
  </div>
</a>
          </div>
        </div>
      
    </div>
  </nav>
</header>
    
    <div class="md-container">
      
        
      
      
      <main class="md-main">
        <div class="md-main__inner md-grid" data-md-component="container">
          
            
              <div class="md-sidebar md-sidebar--primary" data-md-component="navigation">
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    <nav class="md-nav md-nav--primary" data-md-level="0">
  <label class="md-nav__title md-nav__title--site" for="__drawer">
    <a href="https://vesoft-inc.github.io/nebula/" title="Nebula Graph Docs" class="md-nav__button md-logo">
      
        <i class="md-icon">library_books</i>
      
    </a>
    Nebula Graph Docs
  </label>
  
    <div class="md-nav__source">
      


  

<a href="https://github.com/vesoft-inc/nebula/" title="Go to repository" class="md-source" data-md-source="github">
  
    <div class="md-source__icon">
      <svg viewBox="0 0 24 24" width="24" height="24">
        <use xlink:href="#__github" width="24" height="24"></use>
      </svg>
    </div>
  
  <div class="md-source__repository">
    vesoft-inc/nebula
  </div>
</a>
    </div>
  
  <ul class="md-nav__list" data-md-scrollfix>
    
      
      
      


  <li class="md-nav__item">
    <a href=".." title="Home" class="md-nav__link">
      Home
    </a>
  </li>

    
      
      
      

  


  <li class="md-nav__item md-nav__item--active">
    
    <input class="md-toggle md-nav__toggle" data-md-toggle="toc" type="checkbox" id="__toc">
    
    
      <label class="md-nav__link md-nav__link--active" for="__toc">
        Quickstart
      </label>
    
    <a href="./" title="Quickstart" class="md-nav__link md-nav__link--active">
      Quickstart
    </a>
    
      
<nav class="md-nav md-nav--secondary">
  
  
  
    <label class="md-nav__title" for="__toc">Table of contents</label>
    <ul class="md-nav__list" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#step-1-install-nebula-graph" title="Step 1 Install Nebula Graph" class="md-nav__link">
    Step 1 Install Nebula Graph
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#step-2-startup-nebula-graph" title="Step 2 Startup Nebula Graph" class="md-nav__link">
    Step 2 Startup Nebula Graph
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#step-3-simple-query-demo" title="Step 3 Simple Query Demo" class="md-nav__link">
    Step 3 Simple Query Demo
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#step-4-advanced-usage" title="Step 4 Advanced Usage" class="md-nav__link">
    Step 4 Advanced Usage
  </a>
  
</li>
      
      
      
      
      
    </ul>
  
</nav>
    
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3" type="checkbox" id="nav-3">
    
    <label class="md-nav__link" for="nav-3">
      Nebula Reference Manual
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-3">
        Nebula Reference Manual
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../nGQL-tutorial/" title="nGQL Query Language" class="md-nav__link">
      nGQL Query Language
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../how-to-contribute/" title="Contribute to Nebula" class="md-nav__link">
      Contribute to Nebula
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../developer-documentation-style-guide/" title="Developer documentation style guide" class="md-nav__link">
      Developer documentation style guide
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../contribute-to-documentation/" title="Contribute to docs" class="md-nav__link">
      Contribute to docs
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

    
  </ul>
</nav>
                  </div>
                </div>
              </div>
            
            
              <div class="md-sidebar md-sidebar--secondary" data-md-component="toc">
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    
<nav class="md-nav md-nav--secondary">
  
  
  
    <label class="md-nav__title" for="__toc">Table of contents</label>
    <ul class="md-nav__list" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#step-1-install-nebula-graph" title="Step 1 Install Nebula Graph" class="md-nav__link">
    Step 1 Install Nebula Graph
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#step-2-startup-nebula-graph" title="Step 2 Startup Nebula Graph" class="md-nav__link">
    Step 2 Startup Nebula Graph
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#step-3-simple-query-demo" title="Step 3 Simple Query Demo" class="md-nav__link">
    Step 3 Simple Query Demo
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#step-4-advanced-usage" title="Step 4 Advanced Usage" class="md-nav__link">
    Step 4 Advanced Usage
  </a>
  
</li>
      
      
      
      
      
    </ul>
  
</nav>
                  </div>
                </div>
              </div>
            
          
          <div class="md-content">
            <article class="md-content__inner md-typeset">
              
                
                  <a href="https://github.com/vesoft-inc/nebula/edit/master/docs/get-started.md" title="Edit this page" class="md-icon md-content__icon">&#xE3C9;</a>
                
                
                  <h1>Quickstart</h1>
                
                <hr />
<p>This tutorial provides a quick introduction to use Nebula Graph.</p>
<hr />
<h3 id="step-1-install-nebula-graph">Step 1 Install Nebula Graph<a class="headerlink" href="#step-1-install-nebula-graph" title="Permanent link">&para;</a></h3>
<p>The easiest way to startup Nebula is using Docker.
Docker is a tool designed to make it easier to create, deploy, and run applications by using containers.
Containers allow a developer to package up an application with all of the parts it needs,
such as libraries and other dependencies, and ship it all out as one package.
By doing so, the developer can rest assured that the application will run on any other Linux machine regardless of any customized settings that machine might have that could differ from the machine used for writing and testing the code.</p>
<p>First of all, you should make sure that Docker has been installed on your machine. Open a terminal and run the following command :</p>
<div class="codehilite"><pre><span></span>docker --version
</pre></div>


<p>If Docker is not found, please see <a href="https://docs.docker.com/install/">here</a> for more information to install Docker.</p>
<p>After that, using</p>
<div class="codehilite"><pre><span></span>docker pull vesoft/nebula-graph:latest
</pre></div>


<p>to get <code>nebula</code> image and <code>docker images</code> that can display images status.</p>
<p>If the pulling is slow when pulling the image, configure a new mirror.
1. Check if the <code>/etc/docker</code> folder exists, if not, create a new one with <code>mkdir -p /etc/docker</code>. Generally the folder will exist after Docker installation.
2. Create the new file <code>daemon.json</code> with the following command</p>
<div class="codehilite"><pre><span></span>tee /etc/docker/daemon.json &lt;&lt;-&#39;EOF&#39;
{
  &quot;registry-mirrors&quot;: [
    &quot;https://dockerhub.azk8s.cn&quot;,
    &quot;https://reg-mirror.qiniu.com&quot;
  ]
}
EOF
</pre></div>


<p>Or create the new file with <code>vi /etc/docker/daemon.json</code>, then add the following content</p>
<div class="codehilite"><pre><span></span>{
  &quot;registry-mirrors&quot;: [
    &quot;https://dockerhub.azk8s.cn&quot;,
    &quot;https://reg-mirror.qiniu.com&quot;
  ]
}
</pre></div>


<hr />
<h3 id="step-2-startup-nebula-graph">Step 2 Startup Nebula Graph<a class="headerlink" href="#step-2-startup-nebula-graph" title="Permanent link">&para;</a></h3>
<p>When <code>nebula</code> image is ready, run</p>
<div class="codehilite"><pre><span></span>docker run -it vesoft/nebula-graph:latest /bin/bash
</pre></div>


<p>to start and log in to the Docker container.
After login, you're in the <code>root</code> directory and you should use <code>cd ~/nebula-graph/</code> to switch to the nebula home directory.</p>
<p>Run</p>
<div class="codehilite"><pre><span></span>./start-all.sh
</pre></div>


<p>to start meta service, storage service and graph service.</p>
<p>Run</p>
<div class="codehilite"><pre><span></span>ps -ef | grep nebula
</pre></div>


<p>to display the services' running status.</p>
<p>Please make sure the services are working.</p>
<p><code>bin/nebula</code> is a <code>console</code> which can be used to insert and query data.</p>
<p><code>--port</code> is used for specifying the graph server port and the default value is <code>3699</code>.</p>
<p><code>-u</code> and <code>-p</code> are used to specify the user name and password, <code>user</code> and <code>password</code> are the default authority.</p>
<p>Run</p>
<div class="codehilite"><pre><span></span>bin/nebula --port=3699 -u=user -p=password
</pre></div>


<p>to connect to the graph server.</p>
<p>One easier way to start console is to run</p>
<div class="codehilite"><pre><span></span>./start-console.sh
</pre></div>


<div class="codehilite"><pre><span></span>Welcome to Nebula Graph (Version 0.1)

nebula&gt;
</pre></div>


<p>Before query the dataset, you should switch to an existing graph space.</p>
<div class="codehilite"><pre><span></span>nebula&gt; use nba
Execution succeeded (Time spent: 154/793 us)
</pre></div>


<hr />
<h3 id="step-3-simple-query-demo">Step 3 Simple Query Demo<a class="headerlink" href="#step-3-simple-query-demo" title="Permanent link">&para;</a></h3>
<p>This query comes from a vertex walk up an edge.</p>
<div class="codehilite"><pre><span></span>nebula&gt; GO FROM 5209979940224249985 OVER like
========================
|                   id |
========================
| -7187791973189815797 |
------------------------
|  3778194419743477824 |
------------------------
| -6952676908621237908 |
------------------------
........................
</pre></div>


<p>This query comes from a vertex walk up an edge and the target's age should be greater than or equal to 30, also renames the columns as <code>Player</code>, <code>Friend</code> and <code>Age</code>.</p>
<div class="codehilite"><pre><span></span>nebula&gt; GO FROM 5209979940224249985 OVER like WHERE $$[player].age &gt;= 30 YIELD $^[player].name AS Player, $$[player].name AS Friend, $$[player].age AS Age
=============================================
|          Player |            Friend | Age |
=============================================
| Dejounte Murray |      Kevin Durant |  30 |
---------------------------------------------
| Dejounte Murray |        Chris Paul |  33 |
---------------------------------------------
| Dejounte Murray |      LeBron James |  34 |
---------------------------------------------
.............................................
</pre></div>


<p>This query comes from a vertex walk up an edge and the target's age should be greater than or equal to 30.</p>
<p>Setting output result as input, query <code>Player Name</code>, <code>FromYear</code>, <code>ToYear</code> and <code>Team Name</code> with input's <code>id</code>.</p>
<p>In this query, <code>$^</code> is delegated the source vertex and <code>$$</code> is the target vertex.</p>
<p><code>$-</code> is used to indicate the input from pipeline.</p>
<p>(reference to <code>regular expressions</code>, using the special ^ (hat) and $ (dollar sign) metacharacters to describe the start and the end of the line.)</p>
<div class="codehilite"><pre><span></span>nebula&gt; GO FROM 5209979940224249985 OVER like WHERE $$[player].age &gt;= 30 | GO FROM $-.id OVER serve YIELD $^[player].name AS Player, serve.start_year AS FromYear, serve.end_year AS ToYear, $$[team].name AS Team
=====================================================
|            Player | FromYear | ToYear |      Team |
=====================================================
|      Kevin Durant |     2016 |   2019 |  Warriors |
-----------------------------------------------------
|      Kevin Durant |     2007 |   2016 |  Thunders |
-----------------------------------------------------
|        Chris Paul |     2017 |   2021 |   Rockets |
-----------------------------------------------------
.....................................................
</pre></div>


<p>For more detail about Query Language, please see <a href="/nGQL/#traverse-the-graph">Traverse The Graph</a>.</p>
<hr />
<h3 id="step-4-advanced-usage">Step 4 Advanced Usage<a class="headerlink" href="#step-4-advanced-usage" title="Permanent link">&para;</a></h3>
<p>Currently you can create your own graph space, such as :</p>
<div class="codehilite"><pre><span></span>CREATE space myspace(partition_num=1, replica_factor=1)
</pre></div>


<p>When you start <code>Nebula Graph</code>, a set of vertices and edges have already existed.
Currently the default schema is <code>nba</code>.</p>
<p>The graph space describes the relationship between players and teams.
In the graph space, there are two tags (player and team) and two edges (serve and like) which is composed of <code>string</code> and <code>integer</code>.</p>
<p>The Schema looks like :</p>
<div class="codehilite"><pre><span></span>Tag team:
==================
| Field |   Type |
==================
|  name | string |
------------------

Tag player:
==================
| Field |   Type |
==================
|  name | string |
------------------
|   age |    int |
------------------

Edge serve:
=====================
|      Field | Type |
=====================
| start_year |  int |
---------------------
|   end_year |  int |
---------------------

Edge like:
===================
|    Field | Type |
===================
| likeness |  int |
-------------------
</pre></div>


<p>You can create both tag and edge's schema:</p>
<div class="codehilite"><pre><span></span>// create tags schema: players and teams:
CREATE TAG player(name string, age int)

CREATE TAG team(name string)

// create edges schema: players and teams:
CREATE EDGE like(likeness int)

CREATE EDGE serve(start_year int, end_year int)
</pre></div>


<p>You could describe the schema created, for example:</p>
<div class="codehilite"><pre><span></span>DESCRIBE TAG player

DESCRIBE EDGE serve
</pre></div>


<p>The insert sentences look like the following commands.</p>
<div class="codehilite"><pre><span></span>// Insert some vertices: players and teams:
INSERT VERTEX player(name, age) VALUES -8379929135833483044:(&quot;Amar&#39;e Stoudemire&quot;, 36)

INSERT VERTEX team(name) VALUES -9110170398241263635:(&quot;Magic&quot;)

// Insert some edges: likes and serves:
INSERT EDGE like(likeness) VALUES -8379929135833483044 -&gt; 6663720087669302163:(90)

INSERT EDGE serve(start_year, end_year) VALUES -8379929135833483044 -&gt; 868103967282670864:(2002, 2010)
</pre></div>
                
                  
                
              
              
                


              
            </article>
          </div>
        </div>
      </main>
      
        
<footer class="md-footer">
  
    <div class="md-footer-nav">
      <nav class="md-footer-nav__inner md-grid">
        
          <a href=".." title="Home" class="md-flex md-footer-nav__link md-footer-nav__link--prev" rel="prev">
            <div class="md-flex__cell md-flex__cell--shrink">
              <i class="md-icon md-icon--arrow-back md-footer-nav__button"></i>
            </div>
            <div class="md-flex__cell md-flex__cell--stretch md-footer-nav__title">
              <span class="md-flex__ellipsis">
                <span class="md-footer-nav__direction">
                  Previous
                </span>
                Home
              </span>
            </div>
          </a>
        
        
          <a href="../nGQL-tutorial/" title="nGQL Query Language" class="md-flex md-footer-nav__link md-footer-nav__link--next" rel="next">
            <div class="md-flex__cell md-flex__cell--stretch md-footer-nav__title">
              <span class="md-flex__ellipsis">
                <span class="md-footer-nav__direction">
                  Next
                </span>
                nGQL Query Language
              </span>
            </div>
            <div class="md-flex__cell md-flex__cell--shrink">
              <i class="md-icon md-icon--arrow-forward md-footer-nav__button"></i>
            </div>
          </a>
        
      </nav>
    </div>
  
  <div class="md-footer-meta md-typeset">
    <div class="md-footer-meta__inner md-grid">
      <div class="md-footer-copyright">
        
          <div class="md-footer-copyright__highlight">
            Copyright &copy; 2018 - 2019 Nebula Graph
          </div>
        
        powered by
        <a href="https://www.mkdocs.org">MkDocs</a>
        and
        <a href="https://squidfunk.github.io/mkdocs-material/">
          Material for MkDocs</a>
      </div>
      
  <div class="md-footer-social">
    <link rel="stylesheet" href="../assets/fonts/font-awesome.css">
    
      <a href="https://github.com/vesoft-inc/nebula" class="md-footer-social__link fa fa-github"></a>
    
      <a href="https://www.weibo.com/u/7122684542?is_hot=1" class="md-footer-social__link fa fa-weibo"></a>
    
  </div>

    </div>
  </div>
</footer>
      
    </div>
    
      <script src="../assets/javascripts/application.39abc4af.js"></script>
      
      <script>app.initialize({version:"1.0.4",url:{base:".."}})</script>
      
    
  </body>
</html>